{
  "generatedAt": "2026-02-09T15:14:54.466Z",
  "items": [
    {
      "id": "f8aa753a49f00df4",
      "title": "IVE’s Comeback “BANG BANG” Receives Highly Mixed Reactions",
      "url": "https://www.koreaboo.com/news/ive-comeback-bang-bang-receives-highly-mixed-reactions/",
      "source": "Koreaboo",
      "publishedAt": "2026-02-09T13:22:27.000Z",
      "snippet": "What do you think of it?",
      "description": "What do you think of it?",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "comeback",
        "ive"
      ]
    },
    {
      "id": "9c89fd200ef21747",
      "title": "5 K-Dramas With Fangirl Heroines To Watch If You Loved “IDOL I”",
      "url": "https://www.soompi.com/article/1817774wpp/5-k-dramas-with-fangirl-heroines-to-watch-if-you-loved-idol-i",
      "source": "Soompi",
      "publishedAt": "2026-02-09T06:28:39.000Z",
      "snippet": "After six weeks of romance and mystery, Girls Generation’s Sooyoung and Kim Jae Yeong‘s “IDOL I” has finally come to an end on a high note. The drama captivated viewers with its un...",
      "description": "After six weeks of romance and mystery, Girls Generation’s Sooyoung and Kim Jae Yeong‘s “IDOL I” has finally come to an end on a high note. The drama captivated viewers with its unique blend of heartfelt romance, intriguing mystery, and a rare glimpse into the behind-the-scenes world of the K-pop industry. While it’s not easy… Continue reading 5 K-Dramas With Fangirl Heroines To Watch If You Loved “IDOL I” The post 5 K-Dramas With Fangirl Heroines To Watch If You Loved “IDOL I” appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/06220335/idol-i-lovely-runner-her-private-life.jpg",
      "tags": [
        "k-pop",
        "idol"
      ]
    },
    {
      "id": "1125941dc1cf184a",
      "title": "H1-Key to bring out 5th EP next month",
      "url": "https://www.koreaherald.com/article/10672537",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-09T02:15:19.000Z",
      "snippet": "Girl group H1-Key will release its fifth mini album, \"Love Chapter,\" on March 5, Choi Creative Lab announced Monday. The upcoming EP will be its first new release in about nine mon...",
      "description": "Girl group H1-Key will release its fifth mini album, \"Love Chapter,\" on March 5, Choi Creative Lab announced Monday. The upcoming EP will be its first new release in about nine months, coming on the heels of the previous EP \"Lovestruck.\" The last release might have been slow in terms of album sales, but focus track \"Summer Was You\" made a series of best songs lists, ranking No. 6 on NME's \"The 25 Best K-pop Songs of 2025\" and No. 10 on Billboard's ranking. \"Coupled with a soaring and infectious",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/09/news-p.v1.20260209.527392cebd684e84b58aba40e0f5277d_T1.jpg",
      "tags": [
        "k-pop",
        "mini album",
        "album",
        "billboard"
      ]
    },
    {
      "id": "d82379de63ce77fe",
      "title": "Blackpink&apos;s Jisoo hits 100m views on &apos;Earthquake&apos; video",
      "url": "https://www.koreaherald.com/article/10672496",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-09T01:59:55.000Z",
      "snippet": "Jisoo of Blackpink reached the milestone of 100 million views on YouTube with the music video for \"Earthquake\" as of Saturday, according to her agency Blissoo. The video for the fo...",
      "description": "Jisoo of Blackpink reached the milestone of 100 million views on YouTube with the music video for \"Earthquake\" as of Saturday, according to her agency Blissoo. The video for the focus track from her first solo EP, \"Amortage,\" was released in February last year. The single ranked No. 47 on the Billboard Global 200 chart and No. 22 on the Global 200 Excl. US chart. It topped Billboard's World Digital Song Sales Chart. The four-track set debuted atop iTunes albums charts in 45 regions and sold more",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/09/news-p.v1.20260209.560eef7587234fecab37cd3bbab4122e_T1.jpg",
      "tags": [
        "music video",
        "billboard",
        "blackpink"
      ]
    },
    {
      "id": "a5394d893f9ed1c6",
      "title": "BLACKPINK’s Jisoo’s “earthquake” MV Soars Past 100 Million Views",
      "url": "https://www.soompi.com/article/1818056wpp/blackpinks-jisoos-earthquake-mv-soars-past-100-million-views",
      "source": "Soompi",
      "publishedAt": "2026-02-09T00:06:01.000Z",
      "snippet": "BLACKPINK’s Jisoo has hit the 100 million mark with her “earthquake” music video! On February 7 KST at around 3:30 p.m. KST, Jisoo’s music video for “earthquake,” the title track o...",
      "description": "BLACKPINK’s Jisoo has hit the 100 million mark with her “earthquake” music video! On February 7 KST at around 3:30 p.m. KST, Jisoo’s music video for “earthquake,” the title track of her solo mini album “AMORTAGE,” surpassed 100 million views on YouTube. Jisoo originally released the music video for “earthquake” on February 14, 2025 at… Continue reading BLACKPINK’s Jisoo’s “earthquake” MV Soars Past 100 Million Views The post BLACKPINK’s Jisoo’s “earthquake” MV Soars Past 100 Million Views appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/08160400/Jisoo.jpg",
      "tags": [
        "mini album",
        "album",
        "music video",
        "mv",
        "blackpink"
      ]
    },
    {
      "id": "43dc26b0b28d9814",
      "title": "i-dle; CORTIS; Car, The Garden; ILLIT; And HUNTR/X Top Circle Weekly Charts",
      "url": "https://www.soompi.com/article/1818040wpp/i-dle-cortis-car-the-garden-illit-and-huntr-x-top-circle-weekly-charts",
      "source": "Soompi",
      "publishedAt": "2026-02-08T22:20:37.000Z",
      "snippet": "Circle Chart (formerly known as Gaon Chart) has revealed its chart rankings for the week of January 25 to 31! Album Chart CORTIS’s debut EP “COLOR OUTSIDE THE LINES” re-entered the...",
      "description": "Circle Chart (formerly known as Gaon Chart) has revealed its chart rankings for the week of January 25 to 31! Album Chart CORTIS’s debut EP “COLOR OUTSIDE THE LINES” re-entered the physical album chart at No. 1 this week, while EXO’s latest album “REVERXE” stayed strong at No. 2. WHIB’s first mini album “ROCK THE… Continue reading i-dle; CORTIS; Car, The Garden; ILLIT; And HUNTR/X Top Circle Weekly Charts The post i-dle; CORTIS; Car, The Garden; ILLIT; And HUNTR/X Top Circle Weekly Charts appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/08141559/i-dle-CORTIS-Car-the-garden-ILLIT.jpg",
      "tags": [
        "debut",
        "mini album",
        "album",
        "gaon",
        "circle chart",
        "exo"
      ]
    },
    {
      "id": "32363779b3ab851e",
      "title": "Soompi’s K-Pop Music Chart 2026, February Week 2",
      "url": "https://www.soompi.com/article/1817914wpp/soompis-k-pop-music-chart-2026-february-week-2",
      "source": "Soompi",
      "publishedAt": "2026-02-08T17:46:16.000Z",
      "snippet": "KiiiKiii scores their first No. 1 song on our chart with “404 (New Era)” debuting at No. 1. Congratulations to KiiiKiii! The title track from KiiiKiii’s second mini album “Delulu P...",
      "description": "KiiiKiii scores their first No. 1 song on our chart with “404 (New Era)” debuting at No. 1. Congratulations to KiiiKiii! The title track from KiiiKiii’s second mini album “Delulu Pack,” “404 (New Era)” is a UK house/garage-based track built around classic bouncing chords, a weighty bassline, and modern club sounds. It symbolizes a lifestyle… Continue reading Soompi’s K-Pop Music Chart 2026, February Week 2 The post Soompi’s K-Pop Music Chart 2026, February Week 2 appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/08094522/music-chart-1.jpg",
      "tags": [
        "k-pop",
        "mini album",
        "album"
      ]
    },
    {
      "id": "ec52bd35303eacc6",
      "title": "ENHYPEN, Stray Kids, BTS, CORTIS, ILLIT, And NewJeans Sweep Top Spots On Billboard World Albums Chart",
      "url": "https://www.soompi.com/article/1818020wpp/enhypen-stray-kids-bts-cortis-illit-and-newjeans-sweep-top-spots-on-billboard-world-albums-chart",
      "source": "Soompi",
      "publishedAt": "2026-02-08T17:12:48.000Z",
      "snippet": "Billboard has published its World Albums chart for the week ending on February 7! ENHYPEN’s latest mini album “THE SIN: VANISH” spent its second consecutive week at No. 1 on the Wo...",
      "description": "Billboard has published its World Albums chart for the week ending on February 7! ENHYPEN’s latest mini album “THE SIN: VANISH” spent its second consecutive week at No. 1 on the World Albums chart, in addition to charting for a second week on the Billboard 200. Including “THE SIN : VANISH,” ENHYPEN once again landed… Continue reading ENHYPEN, Stray Kids, BTS, CORTIS, ILLIT, And NewJeans Sweep Top Spots On Billboard World Albums Chart The post ENHYPEN, Stray Kids, BTS, CORTIS, ILLIT, And NewJeans Sweep Top Spots On Billboard World Albums Chart appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/08090816/ENHYPEN-Stray-Kids-BTS-CORTIS.jpg",
      "tags": [
        "mini album",
        "album",
        "billboard",
        "bts",
        "stray kids",
        "newjeans"
      ]
    },
    {
      "id": "041703433f85c558",
      "title": "Watch: i-dle Takes 3rd Win For “Mono” On “Inkigayo”; Performances By ATEEZ, KiiiKiii, And More",
      "url": "https://www.soompi.com/article/1817965wpp/watch-i-dle-takes-3rd-win-for-mono-on-inkigayo-performances-by-ateez-kiiikiii-and-more",
      "source": "Soompi",
      "publishedAt": "2026-02-08T14:54:51.000Z",
      "snippet": "i-dle has won a third music show trophy for “Mono” (featuring Skaiwater)! On the February 8 episode of SBS’s “Inkigayo,” the candidates for first place were Car, the Garden’s “My w...",
      "description": "i-dle has won a third music show trophy for “Mono” (featuring Skaiwater)! On the February 8 episode of SBS’s “Inkigayo,” the candidates for first place were Car, the Garden’s “My whole world,” i-dle’s “Mono,” and LE SSERAFIM’s “SPAGHETTI” (featuring BTS’s j-hope). Congratulations to i-dle! Watch their performance, win, and full encore below: Other performers on… Continue reading Watch: i-dle Takes 3rd Win For “Mono” On “Inkigayo”; Performances By ATEEZ, KiiiKiii, And More The post Watch: i-dle Takes 3rd Win For “Mono” On “Inkigayo”; Performances By ATEEZ, KiiiKiii, And More appeared first on S...",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "inkigayo",
        "bts",
        "le sserafim"
      ]
    },
    {
      "id": "d6f0abee028d64fb",
      "title": "BTS achieves highest single-show capacity at Tottenham Hotspur Stadium",
      "url": "https://www.koreaherald.com/article/10672047",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-08T06:20:00.000Z",
      "snippet": "BTS is set to achieve another milestone at the Tottenham Hotspur Stadium in London, with the highest-ever audience capacity for a single concert at the venue, according to Live Nat...",
      "description": "BTS is set to achieve another milestone at the Tottenham Hotspur Stadium in London, with the highest-ever audience capacity for a single concert at the venue, according to Live Nation UK. Via its social media channels, the British concert promoter announced that BTS’ fandom, Army, would “create highest single show capacity” to date for the group’s upcoming concert at the venue. BTS is scheduled to hold two shows at Tottenham Hotspur Stadium on July 6 and 7, with an estimated 120,000 fans attendi",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/08/news-p.v1.20260208.51837ba74fb34eab83af00fbe05225fb_T1.jpg",
      "tags": [
        "concert",
        "bts"
      ]
    },
    {
      "id": "adb33fd5d914148f",
      "title": "Blackpink, Ive to face off for chart success in late February",
      "url": "https://www.koreaherald.com/article/10672006",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-08T04:15:44.000Z",
      "snippet": "A grand face-off in K-pop is on the horizon, as two of the industry’s most prominent girl groups — Blackpink and Ive — are gearing up for back-to-back releases late this month. Wit...",
      "description": "A grand face-off in K-pop is on the horizon, as two of the industry’s most prominent girl groups — Blackpink and Ive — are gearing up for back-to-back releases late this month. With only four days separating the two groups’ respective returns, K-pop fans are anticipating a head-to-head battle on the charts, pitting one of the most globally recognized acts against a leading fourth-generation girl group, each of them known for consistently putting out hits. On Feb. 27, Blackpink will release its t",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/08/news-p.v1.20260208.03b256622e6647af8cc0f5ad05657179_T1.jpg",
      "tags": [
        "k-pop",
        "blackpink",
        "ive"
      ]
    },
    {
      "id": "31c3318b1bed69b5",
      "title": "Watch: ATEEZ Delivers An “Adrenaline” Rush In Intense Dance Practice Video",
      "url": "https://www.soompi.com/article/1817884wpp/watch-ateez-delivers-an-adrenaline-rush-in-intense-dance-practice-video",
      "source": "Soompi",
      "publishedAt": "2026-02-08T03:28:57.000Z",
      "snippet": "ATEEZ is back with another epic dance practice video! On February 8, ATEEZ released the official dance practice video for “Adrenaline,” the chart-topping title track of their new m...",
      "description": "ATEEZ is back with another epic dance practice video! On February 8, ATEEZ released the official dance practice video for “Adrenaline,” the chart-topping title track of their new mini album “GOLDEN HOUR : Part.4.” The new video offers a full view of the song’s powerful choreography and the eight ATEEZ members’ impressively synchronized moves, along… Continue reading Watch: ATEEZ Delivers An “Adrenaline” Rush In Intense Dance Practice Video The post Watch: ATEEZ Delivers An “Adrenaline” Rush In Intense Dance Practice Video appeared first on Soompi.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "mini album",
        "album"
      ]
    },
    {
      "id": "eea8b39c80458064",
      "title": "NCT WISH Is 1st K-Pop Boy Group In YouTube History To Hit 100 Million Views With A Short",
      "url": "https://www.soompi.com/article/1817860wpp/nct-wish-is-1st-k-pop-boy-group-in-youtube-history-to-hit-100-million-views-with-a-short",
      "source": "Soompi",
      "publishedAt": "2026-02-08T01:01:01.000Z",
      "snippet": "NCT WISH has just made YouTube history! On February 8 KST, NCT WISH’s “Cham Cham Cham” short-form video surpassed 100 million views on YouTube, making them the first K-pop boy grou...",
      "description": "NCT WISH has just made YouTube history! On February 8 KST, NCT WISH’s “Cham Cham Cham” short-form video surpassed 100 million views on YouTube, making them the first K-pop boy group ever to reach the milestone with a YouTube Short posted on their official account. The viral video, which was first posted in August of… Continue reading NCT WISH Is 1st K-Pop Boy Group In YouTube History To Hit 100 Million Views With A Short The post NCT WISH Is 1st K-Pop Boy Group In YouTube History To Hit 100 Million Views With A Short appeared first on Soompi.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "k-pop",
        "nct"
      ]
    },
    {
      "id": "51ff455d7f558b04",
      "title": "Stray Kids Hits No. 1 At U.S. Box Office With New Film “The dominATE Experience”",
      "url": "https://www.soompi.com/article/1817850wpp/stray-kids-hits-no-1-at-u-s-box-office-with-new-film-the-dominate-experience",
      "source": "Soompi",
      "publishedAt": "2026-02-08T00:01:32.000Z",
      "snippet": "Stray Kids dominated the U.S. box office with their new feature film! On February 6, the group’s new concert film “Stray Kids: The dominATE Experience” took No. 1 at the U.S. box o...",
      "description": "Stray Kids dominated the U.S. box office with their new feature film! On February 6, the group’s new concert film “Stray Kids: The dominATE Experience” took No. 1 at the U.S. box office on its official opening day. According to The Numbers, the film—which features footage from Stray Kids’ concert at SoFi Stadium in California—grossed… Continue reading Stray Kids Hits No. 1 At U.S. Box Office With New Film “The dominATE Experience” The post Stray Kids Hits No. 1 At U.S. Box Office With New Film “The dominATE Experience” appeared first on Soompi.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "concert",
        "stray kids"
      ]
    },
    {
      "id": "15b5751747717906",
      "title": "ATEEZ Tops Charts All Over The World With “Adrenaline” And “GOLDEN HOUR : Part.4”",
      "url": "https://www.soompi.com/article/1817801wpp/ateez-tops-charts-all-over-the-world-with-adrenaline-and-golden-hour-part-4",
      "source": "Soompi",
      "publishedAt": "2026-02-07T06:01:35.000Z",
      "snippet": "ATEEZ’s latest comeback is off to a strong start! On February 6 at 2 p.m. KST, ATEEZ made their highly-anticipated return with their new mini album “GOLDEN HOUR : Part.4” and its t...",
      "description": "ATEEZ’s latest comeback is off to a strong start! On February 6 at 2 p.m. KST, ATEEZ made their highly-anticipated return with their new mini album “GOLDEN HOUR : Part.4” and its title track “Adrenaline.” Shortly afterwards, both the mini album and the song soared to the top of iTunes charts in numerous countries across… Continue reading ATEEZ Tops Charts All Over The World With “Adrenaline” And “GOLDEN HOUR : Part.4” The post ATEEZ Tops Charts All Over The World With “Adrenaline” And “GOLDEN HOUR : Part.4” appeared first on Soompi.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "comeback",
        "mini album",
        "album"
      ]
    },
    {
      "id": "25b4ffbd63477362",
      "title": "February Boy Group Brand Reputation Rankings Announced",
      "url": "https://www.soompi.com/article/1817781wpp/february-boy-group-brand-reputation-rankings-announced-8",
      "source": "Soompi",
      "publishedAt": "2026-02-07T02:24:55.000Z",
      "snippet": "The Korean Business Research Institute has revealed this month’s brand reputation rankings for male idol groups! The rankings were determined through an analysis of the consumer pa...",
      "description": "The Korean Business Research Institute has revealed this month’s brand reputation rankings for male idol groups! The rankings were determined through an analysis of the consumer participation, media coverage, interaction, and community indexes of various boy groups, using big data collected from January 7 to February 7. BTS continued their reign at the top of… Continue reading February Boy Group Brand Reputation Rankings Announced The post February Boy Group Brand Reputation Rankings Announced appeared first on Soompi.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "idol",
        "bts"
      ]
    },
    {
      "id": "58877928ba54ffd9",
      "title": "BTS to turn Seoul into cultural stage with ‘The City Seoul’",
      "url": "https://www.koreaherald.com/article/10671570",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T08:58:18.000Z",
      "snippet": "BTS will be extending its comeback celebrations beyond the stage and into Seoul itself as it transforms the city into a massive, immersive cultural venue this spring. “BTS The City...",
      "description": "BTS will be extending its comeback celebrations beyond the stage and into Seoul itself as it transforms the city into a massive, immersive cultural venue this spring. “BTS The City Arirang Seoul,” launching March 20 and running through April 12, is a citywide project marking the release of BTS' fifth album “Arirang,” agency Big Hit Music announced Thursday. The event will also follow the group's comeback show, “BTS Comeback Live: Arirang,” set for Gwanghwamun Square in central Seoul. “In collabo",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.d925ef6a4e274eb5a3a815bf17920244_T1.jpg",
      "tags": [
        "comeback",
        "album",
        "bts"
      ]
    },
    {
      "id": "7e0e36b3f30ef908",
      "title": "Blackpink unveils tracklist for new EP, with ‘Go’ as main track",
      "url": "https://www.koreaherald.com/article/10671525",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T07:47:05.000Z",
      "snippet": "Blackpink has revealed the tracklist for its upcoming third EP “Deadline,” marking the group’s first full-member release in approximately three years and five months. According to...",
      "description": "Blackpink has revealed the tracklist for its upcoming third EP “Deadline,” marking the group’s first full-member release in approximately three years and five months. According to YG Entertainment on Friday, the new album will feature five tracks: pre-release single “Jump,” main track “Go,” as well as B-side tracks “Me and My,” “Champion” and “Fxxxboy.” YG describes the album as a snapshot of the girl group at its peak. “As the title ‘Deadline’ suggests, the album will be filled with Blackpink’s",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.48bdab8d2b56437ebd6a0774a9d1fe3d_T1.jpg",
      "tags": [
        "album",
        "blackpink"
      ]
    },
    {
      "id": "35a8de7b70c4c89d",
      "title": "Hearts2Hearts to drop new single",
      "url": "https://www.koreaherald.com/article/10671169",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T02:05:32.000Z",
      "snippet": "Rookie girl group Hearts2Hearts is poised to release a single, label SM Entertainment said Friday. The group will drop “Rude!” on Feb. 20, about four months after its first EP, “Fo...",
      "description": "Rookie girl group Hearts2Hearts is poised to release a single, label SM Entertainment said Friday. The group will drop “Rude!” on Feb. 20, about four months after its first EP, “Focus.” It debuted in February 2025 with “The Chase” and added the digital single “Style” in June, followed by a mini album in October. The group took home seven rookie awards by the end of the year and was a candidate for best new artist (K-pop) at the 2026 iHeartRadio Music Awards. On Feb. 21-22, the eight members will",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.976c9b841f9a4797bedc2de042e8e592_T1.jpg",
      "tags": [
        "k-pop",
        "mini album",
        "album"
      ]
    },
    {
      "id": "e92e22d9ab2edc96",
      "title": "Ive announces March fan concert",
      "url": "https://www.koreaherald.com/article/10671103",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T01:23:02.000Z",
      "snippet": "Ive will hold its fourth fan concert March 21-22 in Incheon, its agency Starship Entertainment announced Thursday. The second day’s event will be broadcast online to reach more fan...",
      "description": "Ive will hold its fourth fan concert March 21-22 in Incheon, its agency Starship Entertainment announced Thursday. The second day’s event will be broadcast online to reach more fans. The group of six named the two-date event “Ive into Dive,” emphasizing its connection with fans. Dive is the name of its official fandom community. At the fan concert, Ive is expected to perform new songs from its second studio album “Revive+” which is due out on Feb. 23. On Monday, the group will drop the B-side tr",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.6bdcc8bed9fe4aebbc26ec7676fb0d56_T1.jpg",
      "tags": [
        "album",
        "concert",
        "ive"
      ]
    },
    {
      "id": "640856f8966dde7a",
      "title": "The ‘BTS effect’ becomes reality in Seoul",
      "url": "https://www.koreaherald.com/article/10669622",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T05:59:40.000Z",
      "snippet": "With a little more than a month left until BTS’ historic return to the stage, Seoul is already feeling the heat. The group’s concert on March 21 at Gwanghwamun Square — their first...",
      "description": "With a little more than a month left until BTS’ historic return to the stage, Seoul is already feeling the heat. The group’s concert on March 21 at Gwanghwamun Square — their first full-group performance in over three years — has sent ripple effects through Seoul’s hospitality, retail and aviation industries, with nearby luxury hotels booked out and even budget motels hiking rates to nearly 500,000 won ($344) a night. Hotel industry data and tourism platforms show that the “BTS effect” is alread",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.d85707d318624b7ab7aa74d5084b44de_T1.jpg",
      "tags": [
        "concert",
        "bts"
      ]
    },
    {
      "id": "af242ab72befb734",
      "title": "Le Sserafim’s encore Seoul show — tightly choreographed to the last beat",
      "url": "https://www.koreaherald.com/article/10669577",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T05:18:14.000Z",
      "snippet": "Le Sserafim wrapped up its first world tour, “Easy Crazy Hot,” with a sold-out encore concert in Seoul on Sunday, closing a run that spanned 31 shows across 20 cities. Held at Jams...",
      "description": "Le Sserafim wrapped up its first world tour, “Easy Crazy Hot,” with a sold-out encore concert in Seoul on Sunday, closing a run that spanned 31 shows across 20 cities. Held at Jamsil Indoor Stadium, the final performance drew a near-capacity crowd, excluding limited-view seats. The tour, which began in Incheon in April last year, marked nearly a full year on the road for the group. Despite the demanding schedule, the members powered through a three-hour set featuring 26 songs, including original",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260203.d793e408b7b84e6b9d2b03104d563b72_T1.jpg",
      "tags": [
        "world tour",
        "concert",
        "le sserafim"
      ]
    },
    {
      "id": "82ef66d494a2bfa1",
      "title": "BTS logs 3m presaves on Spotify",
      "url": "https://www.koreaherald.com/article/10669476",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T03:21:29.000Z",
      "snippet": "The soon-to-be-released album from BTS amassed 3 million presaves on Spotify as of Wednesday. Its fifth full album “Arirang” has remained atop the platform's Countdown Chart Global...",
      "description": "The soon-to-be-released album from BTS amassed 3 million presaves on Spotify as of Wednesday. Its fifth full album “Arirang” has remained atop the platform's Countdown Chart Global for two weeks. The album will be available on March 20, a much-hyped return of the septet as a full group after more than 3 1/2 years away from the music scene. Fans have been listening to its old songs on repeat, pushing a number of them past milestones. “Yet To Come” from anthology album “Proof” and “Love Maze” from",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.9940a1d4b7a94a6083052dd62f30fb80_T1.jpg",
      "tags": [
        "album",
        "bts"
      ]
    },
    {
      "id": "f04b92b6858c8a7b",
      "title": "FTIsland to host first fan meetup in 10 years",
      "url": "https://www.koreaherald.com/article/10669467",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T02:55:14.000Z",
      "snippet": "FTIsland is planning to hold a fan meeting in Seoul on March 7, its first in a decade, its agency FNC Entertainment said Wednesday. The band uploaded a poster with a detective agen...",
      "description": "FTIsland is planning to hold a fan meeting in Seoul on March 7, its first in a decade, its agency FNC Entertainment said Wednesday. The band uploaded a poster with a detective agency theme, showing each of the three members dressed in suits. The event, dubbed “FT Agency,” also celebrates the three bandmates committing to the future of the group, having renewed contracts with the agency last week. The trio has been with the agency since the group's debut in 2007. Also on March 7, Lee Honggi will",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.26deea72d83f4eb4bfcafb0fbc618461_T1.jpg",
      "tags": [
        "debut",
        "fan meeting"
      ]
    },
    {
      "id": "162aa995748ea3ae",
      "title": "Riize to drop Japan single ahead of album release",
      "url": "https://www.koreaherald.com/article/10669407",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T02:22:59.000Z",
      "snippet": "Riize will give fans an early listen to its second single in Japan, unveiling the title track as a prerelease on Feb. 9, label SM Entertainment announced Wednesday. The group is se...",
      "description": "Riize will give fans an early listen to its second single in Japan, unveiling the title track as a prerelease on Feb. 9, label SM Entertainment announced Wednesday. The group is set to release its single album “All of You” on Feb. 18, but will drop the title track beforehand. Starting with Shotaro’s narration, the hip-hop tune is a confession of love to the group's fans, peppered with “saranghae,” meaning \"I love you\" in Korean. The upcoming single follows about 1 1/2 years after Riize's first s",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.db021ad91e7f4caf9e1cd927d905cd1c_T1.jpg",
      "tags": [
        "album",
        "riize"
      ]
    },
    {
      "id": "bd07cc9ecc50e4ec",
      "title": "Seoul city govt. plans for crowd control, anti-price gouging around BTS comeback show",
      "url": "https://www.koreaherald.com/article/10669358",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T02:10:13.000Z",
      "snippet": "The Seoul metropolitan government compiled a set of crowd control and anti-price-gouging measures Wednesday to effectively handle the large crowds expected to gather for K-pop grou...",
      "description": "The Seoul metropolitan government compiled a set of crowd control and anti-price-gouging measures Wednesday to effectively handle the large crowds expected to gather for K-pop group BTS' comeback show next month. During a meeting led by Seoul Mayor Oh Se-hoon, the city government discussed ways to prepare for the concert set to be held at Gwanghwamun Square on March 21. With tens of thousands of fans expected to converge on the square and its surrounding areas, the local government said it plans",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.79741b79a81d4677bc4d2281f401809e_T1.jpg",
      "tags": [
        "k-pop",
        "comeback",
        "concert",
        "bts"
      ]
    },
    {
      "id": "2d6173f8b8e43fd0",
      "title": "Twice subunit rolls out Japan LP",
      "url": "https://www.koreaherald.com/article/10669309",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T01:42:41.000Z",
      "snippet": "Twice’s subunit Misamo released its first studio album in Japan, “Play,” on Feb. 4, label JYP Entertainment announced Wednesday. Mina, Sana and Momo put out the LP as the final pie...",
      "description": "Twice’s subunit Misamo released its first studio album in Japan, “Play,” on Feb. 4, label JYP Entertainment announced Wednesday. Mina, Sana and Momo put out the LP as the final piece of an art-themed trilogy, following “Masterpiece” and “Haute Couture.” The former signaled the unit's debut in Japan in 2023, and the second EP came out in November 2024. The group's debut EP was the most-sold album from a female musician in Japan in 2023, and topped Oricon’s Daily and Weekly Album Rankings. The sec",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.c1a595822bfe43af84366fcbf4f99c2a_T1.jpg",
      "tags": [
        "debut",
        "album",
        "twice"
      ]
    },
    {
      "id": "d7a61dfe59eb1c76",
      "title": "Why Rose was unable to win a Grammy for ‘APT.’",
      "url": "https://www.koreaherald.com/article/10668687",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-03T05:42:18.000Z",
      "snippet": "Despite three nominations, Rose walked away from the 68th Grammy Awards empty-handed — a result that mirrors the uphill battle K-pop artists have long faced with the Recording Acad...",
      "description": "Despite three nominations, Rose walked away from the 68th Grammy Awards empty-handed — a result that mirrors the uphill battle K-pop artists have long faced with the Recording Academy. Rose is not the first K-pop artist to fall short of a Grammy win, starting with Psy’s nomination for best music video with “Gangnam Style” in 2012, as well as BTS’ nominations for best pop duo/group performance between 2021 and 2023. Ultimately, the Grammy Awards held firm in their reputation as one of the most co",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/03/news-p.v1.20260203.d4ffc7cb6cc441628fb5eaa7e93e7a11_T1.jpg",
      "tags": [
        "k-pop",
        "music video",
        "bts"
      ]
    },
    {
      "id": "d49aa9162ed4fd77",
      "title": "NCT’s Jeno, Jaemin float teaser for duo set",
      "url": "https://www.koreaherald.com/article/10668564",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-03T02:37:27.000Z",
      "snippet": "The countdown has begun for Jeno and Jaemin of NCT's first EP as a duo subunit, with release set for Feb. 23. SM Entertainment uploaded a poster detailing the timeline of teaser co...",
      "description": "The countdown has begun for Jeno and Jaemin of NCT's first EP as a duo subunit, with release set for Feb. 23. SM Entertainment uploaded a poster detailing the timeline of teaser content for “Both Sides” by NCT JNJM to NCT's social media channels Tuesday. On it, sheets of freshly printed paper tell fans when to expect everything from concept photograph drops to music video trailers in the lead-up to the release. Including the title track, the upcoming album will consist of six tracks. Separately,",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/03/news-p.v1.20260203.ffa054facdd64adb82bbda7db9793efc_T1.jpg",
      "tags": [
        "album",
        "music video",
        "nct"
      ]
    },
    {
      "id": "3577fc347c4599d0",
      "title": "Onew&apos;s 5th solo EP releases next month",
      "url": "https://www.koreaherald.com/article/10668460",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-03T02:06:10.000Z",
      "snippet": "Onew of Shinee is gearing up for a solo return on March 9, agency Griffin Entertainment announced Tuesday. The singer's fifth solo EP, “Tough Love,” comes about eight months after...",
      "description": "Onew of Shinee is gearing up for a solo return on March 9, agency Griffin Entertainment announced Tuesday. The singer's fifth solo EP, “Tough Love,” comes about eight months after his second album, “Percent.” The 11-track set topped the iTunes Top Albums chart in nine regions. Onew gave fans a taste of what is to come, unveiling a teaser video at his encore concert held in Seoul on Sunday as part of “Onew The Live: Percent.” Sunday's show was the finale of the monthslong tour, which was also the",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/03/news-p.v1.20260203.a405b5dbc1a049f1b36d70b1da812794_T1.jpg",
      "tags": [
        "album",
        "concert",
        "shinee"
      ]
    }
  ]
}