{
  "generatedAt": "2026-02-08T05:45:20.969Z",
  "items": [
    {
      "id": "adb33fd5d914148f",
      "title": "Blackpink, Ive to face off for chart success in late February",
      "url": "https://www.koreaherald.com/article/10672006",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-08T04:15:44.000Z",
      "snippet": "A grand face-off in K-pop is on the horizon, as two of the industry’s most prominent girl groups — Blackpink and Ive — are gearing up for back-to-back releases late this month. Wit...",
      "description": "A grand face-off in K-pop is on the horizon, as two of the industry’s most prominent girl groups — Blackpink and Ive — are gearing up for back-to-back releases late this month. With only four days separating the two groups’ respective returns, K-pop fans are anticipating a head-to-head battle on the charts, pitting one of the most globally recognized acts against a leading fourth-generation girl group, each of them known for consistently putting out hits. On Feb. 27, Blackpink will release its t",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/08/news-p.v1.20260208.03b256622e6647af8cc0f5ad05657179_T1.jpg",
      "tags": [
        "k-pop",
        "blackpink",
        "ive"
      ]
    },
    {
      "id": "31c3318b1bed69b5",
      "title": "Watch: ATEEZ Delivers An “Adrenaline” Rush In Intense Dance Practice Video",
      "url": "https://www.soompi.com/article/1817884wpp/watch-ateez-delivers-an-adrenaline-rush-in-intense-dance-practice-video",
      "source": "Soompi",
      "publishedAt": "2026-02-08T03:28:57.000Z",
      "snippet": "ATEEZ is back with another epic dance practice video! On February 8, ATEEZ released the official dance practice video for “Adrenaline,” the chart-topping title track of their new m...",
      "description": "ATEEZ is back with another epic dance practice video! On February 8, ATEEZ released the official dance practice video for “Adrenaline,” the chart-topping title track of their new mini album “GOLDEN HOUR : Part.4.” The new video offers a full view of the song’s powerful choreography and the eight ATEEZ members’ impressively synchronized moves, along… Continue reading Watch: ATEEZ Delivers An “Adrenaline” Rush In Intense Dance Practice Video The post Watch: ATEEZ Delivers An “Adrenaline” Rush In Intense Dance Practice Video appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/07192719/ATEEZ_528bdc.jpg",
      "tags": [
        "mini album",
        "album"
      ]
    },
    {
      "id": "a55361c5c2e1cf33",
      "title": "Idol-Turned-Actress Reveals The Real Reason She Debuted In A K-Pop Girl Group",
      "url": "https://www.koreaboo.com/news/seeya-nam-gyuri-idol-turned-actress-real-reason-debut-story/",
      "source": "Koreaboo",
      "publishedAt": "2026-02-08T02:01:20.000Z",
      "snippet": "It wasn't necessarily her dream.",
      "description": "It wasn't necessarily her dream.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "k-pop",
        "idol"
      ]
    },
    {
      "id": "eea8b39c80458064",
      "title": "NCT WISH Is 1st K-Pop Boy Group In YouTube History To Hit 100 Million Views With A Short",
      "url": "https://www.soompi.com/article/1817860wpp/nct-wish-is-1st-k-pop-boy-group-in-youtube-history-to-hit-100-million-views-with-a-short",
      "source": "Soompi",
      "publishedAt": "2026-02-08T01:01:01.000Z",
      "snippet": "NCT WISH has just made YouTube history! On February 8 KST, NCT WISH’s “Cham Cham Cham” short-form video surpassed 100 million views on YouTube, making them the first K-pop boy grou...",
      "description": "NCT WISH has just made YouTube history! On February 8 KST, NCT WISH’s “Cham Cham Cham” short-form video surpassed 100 million views on YouTube, making them the first K-pop boy group ever to reach the milestone with a YouTube Short posted on their official account. The viral video, which was first posted in August of… Continue reading NCT WISH Is 1st K-Pop Boy Group In YouTube History To Hit 100 Million Views With A Short The post NCT WISH Is 1st K-Pop Boy Group In YouTube History To Hit 100 Million Views With A Short appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/07165930/NCT-WISH.jpg",
      "tags": [
        "k-pop",
        "nct"
      ]
    },
    {
      "id": "51ff455d7f558b04",
      "title": "Stray Kids Hits No. 1 At U.S. Box Office With New Film “The dominATE Experience”",
      "url": "https://www.soompi.com/article/1817850wpp/stray-kids-hits-no-1-at-u-s-box-office-with-new-film-the-dominate-experience",
      "source": "Soompi",
      "publishedAt": "2026-02-08T00:01:32.000Z",
      "snippet": "Stray Kids dominated the U.S. box office with their new feature film! On February 6, the group’s new concert film “Stray Kids: The dominATE Experience” took No. 1 at the U.S. box o...",
      "description": "Stray Kids dominated the U.S. box office with their new feature film! On February 6, the group’s new concert film “Stray Kids: The dominATE Experience” took No. 1 at the U.S. box office on its official opening day. According to The Numbers, the film—which features footage from Stray Kids’ concert at SoFi Stadium in California—grossed… Continue reading Stray Kids Hits No. 1 At U.S. Box Office With New Film “The dominATE Experience” The post Stray Kids Hits No. 1 At U.S. Box Office With New Film “The dominATE Experience” appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/07155925/Stray-Kids-1.jpg",
      "tags": [
        "concert",
        "stray kids"
      ]
    },
    {
      "id": "15b5751747717906",
      "title": "ATEEZ Tops Charts All Over The World With “Adrenaline” And “GOLDEN HOUR : Part.4”",
      "url": "https://www.soompi.com/article/1817801wpp/ateez-tops-charts-all-over-the-world-with-adrenaline-and-golden-hour-part-4",
      "source": "Soompi",
      "publishedAt": "2026-02-07T06:01:35.000Z",
      "snippet": "ATEEZ’s latest comeback is off to a strong start! On February 6 at 2 p.m. KST, ATEEZ made their highly-anticipated return with their new mini album “GOLDEN HOUR : Part.4” and its t...",
      "description": "ATEEZ’s latest comeback is off to a strong start! On February 6 at 2 p.m. KST, ATEEZ made their highly-anticipated return with their new mini album “GOLDEN HOUR : Part.4” and its title track “Adrenaline.” Shortly afterwards, both the mini album and the song soared to the top of iTunes charts in numerous countries across… Continue reading ATEEZ Tops Charts All Over The World With “Adrenaline” And “GOLDEN HOUR : Part.4” The post ATEEZ Tops Charts All Over The World With “Adrenaline” And “GOLDEN HOUR : Part.4” appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/06215804/ATEEZ.jpg",
      "tags": [
        "comeback",
        "mini album",
        "album"
      ]
    },
    {
      "id": "25b4ffbd63477362",
      "title": "February Boy Group Brand Reputation Rankings Announced",
      "url": "https://www.soompi.com/article/1817781wpp/february-boy-group-brand-reputation-rankings-announced-8",
      "source": "Soompi",
      "publishedAt": "2026-02-07T02:24:55.000Z",
      "snippet": "The Korean Business Research Institute has revealed this month’s brand reputation rankings for male idol groups! The rankings were determined through an analysis of the consumer pa...",
      "description": "The Korean Business Research Institute has revealed this month’s brand reputation rankings for male idol groups! The rankings were determined through an analysis of the consumer participation, media coverage, interaction, and community indexes of various boy groups, using big data collected from January 7 to February 7. BTS continued their reign at the top of… Continue reading February Boy Group Brand Reputation Rankings Announced The post February Boy Group Brand Reputation Rankings Announced appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/06182235/BTS-Stray-Kids-EXO.jpg",
      "tags": [
        "idol",
        "bts"
      ]
    },
    {
      "id": "58877928ba54ffd9",
      "title": "BTS to turn Seoul into cultural stage with ‘The City Seoul’",
      "url": "https://www.koreaherald.com/article/10671570",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T08:58:18.000Z",
      "snippet": "BTS will be extending its comeback celebrations beyond the stage and into Seoul itself as it transforms the city into a massive, immersive cultural venue this spring. “BTS The City...",
      "description": "BTS will be extending its comeback celebrations beyond the stage and into Seoul itself as it transforms the city into a massive, immersive cultural venue this spring. “BTS The City Arirang Seoul,” launching March 20 and running through April 12, is a citywide project marking the release of BTS' fifth album “Arirang,” agency Big Hit Music announced Thursday. The event will also follow the group's comeback show, “BTS Comeback Live: Arirang,” set for Gwanghwamun Square in central Seoul. “In collabo",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.d925ef6a4e274eb5a3a815bf17920244_T1.jpg",
      "tags": [
        "comeback",
        "album",
        "bts"
      ]
    },
    {
      "id": "7e0e36b3f30ef908",
      "title": "Blackpink unveils tracklist for new EP, with ‘Go’ as main track",
      "url": "https://www.koreaherald.com/article/10671525",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T07:47:05.000Z",
      "snippet": "Blackpink has revealed the tracklist for its upcoming third EP “Deadline,” marking the group’s first full-member release in approximately three years and five months. According to...",
      "description": "Blackpink has revealed the tracklist for its upcoming third EP “Deadline,” marking the group’s first full-member release in approximately three years and five months. According to YG Entertainment on Friday, the new album will feature five tracks: pre-release single “Jump,” main track “Go,” as well as B-side tracks “Me and My,” “Champion” and “Fxxxboy.” YG describes the album as a snapshot of the girl group at its peak. “As the title ‘Deadline’ suggests, the album will be filled with Blackpink’s",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.48bdab8d2b56437ebd6a0774a9d1fe3d_T1.jpg",
      "tags": [
        "album",
        "blackpink"
      ]
    },
    {
      "id": "8417837d35eb4e3b",
      "title": "RIIZE’s Shotaro Unable To Participate In Macau Concerts",
      "url": "https://www.soompi.com/article/1817728wpp/riizes-shotaro-unable-to-participate-in-macau-concerts",
      "source": "Soompi",
      "publishedAt": "2026-02-06T07:42:36.000Z",
      "snippet": "RIIZE’s Shotaro will not be participating in the group’s Macau concerts. On February 6, the production company behind RIIZE’s Macau concert posted an official notice stating that S...",
      "description": "RIIZE’s Shotaro will not be participating in the group’s Macau concerts. On February 6, the production company behind RIIZE’s Macau concert posted an official notice stating that Shotaro will be absent from RIIZE’s first world tour “RIIZING LOUD” in Macau. Read the announcement below: While the specific reason for Shotaro’s absence was not disclosed, speculation… Continue reading RIIZE’s Shotaro Unable To Participate In Macau Concerts The post RIIZE’s Shotaro Unable To Participate In Macau Concerts appeared first on Soompi.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "world tour",
        "concert",
        "riize"
      ]
    },
    {
      "id": "b0c3e5315a95c88f",
      "title": "Hearts2Hearts Announces Comeback Date And Details For Return With “RUDE!”",
      "url": "https://www.soompi.com/article/1817570wpp/hearts2hearts-announces-comeback-date-and-details-for-return-with-rude",
      "source": "Soompi",
      "publishedAt": "2026-02-06T00:28:15.000Z",
      "snippet": "Mark your calendars for Hearts2Hearts’ return! On February 6, SM Entertainment officially announced the date and details for their rookie girl group’s highly-anticipated comeback....",
      "description": "Mark your calendars for Hearts2Hearts’ return! On February 6, SM Entertainment officially announced the date and details for their rookie girl group’s highly-anticipated comeback. Hearts2Hearts will be returning with the new single “RUDE!” on February 20 at 6 p.m. KST, marking their first comeback since releasing their first mini album “FOCUS” in October. Check out… Continue reading Hearts2Hearts Announces Comeback Date And Details For Return With “RUDE!” The post Hearts2Hearts Announces Comeback Date And Details For Return With “RUDE!” appeared first on Soompi.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "comeback",
        "mini album",
        "album"
      ]
    },
    {
      "id": "2bbedf62ae500a17",
      "title": "BLACKPINK’s Lisa To Star In New Netflix Film",
      "url": "https://www.soompi.com/article/1817554wpp/blackpinks-lisa-to-star-in-new-netflix-film",
      "source": "Soompi",
      "publishedAt": "2026-02-05T22:21:05.000Z",
      "snippet": "BLACKPINK’s Lisa is set to make her feature film debut! On February 5 local time, Netflix officially announced that Lisa would be starring in a new “Notting Hill”-inspired romantic...",
      "description": "BLACKPINK’s Lisa is set to make her feature film debut! On February 5 local time, Netflix officially announced that Lisa would be starring in a new “Notting Hill”-inspired romantic comedy feature film penned by Katie Silberman, the writer of “Booksmart” and “Set It Up.” Although Lisa previously made her small-screen debut in Season 3 of… Continue reading BLACKPINK’s Lisa To Star In New Netflix Film The post BLACKPINK’s Lisa To Star In New Netflix Film appeared first on Soompi.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "debut",
        "blackpink"
      ]
    },
    {
      "id": "d2bd9986b038b7b1",
      "title": "TXT Confirmed To Make April Comeback",
      "url": "https://www.soompi.com/article/1817517wpp/txt-confirmed-to-make-april-comeback",
      "source": "Soompi",
      "publishedAt": "2026-02-05T11:12:22.000Z",
      "snippet": "TXT is officially gearing up for a comeback! On February 5, Sports Seoul reported that TXT has confirmed plans to make a comeback in April and is currently focusing on album prepar...",
      "description": "TXT is officially gearing up for a comeback! On February 5, Sports Seoul reported that TXT has confirmed plans to make a comeback in April and is currently focusing on album preparations. In response to the report, their agency BIGHIT MUSIC confirmed, “TXT is working on their album with the goal of making a comeback… Continue reading TXT Confirmed To Make April Comeback The post TXT Confirmed To Make April Comeback appeared first on Soompi.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "comeback",
        "album"
      ]
    },
    {
      "id": "97ca1729f6089c3a",
      "title": "Exclusive: ATEEZ Talks Contract Renewal, Favorite “Adrenaline” MV Scenes, Enlistment Duties, And More At “GOLDEN HOUR: Part.4” Press Conference",
      "url": "https://www.soompi.com/article/1817423wpp/exclusive-ateez-talks-contract-renewal-favorite-adrenaline-mv-scenes-enlistment-duties-and-more-at-golden-hour-part-4-press-conference",
      "source": "Soompi",
      "publishedAt": "2026-02-05T09:17:30.000Z",
      "snippet": "ATEEZ is gearing up for their highly-anticipated comeback with “GOLDEN HOUR : Part.4”! On February 5, ahead of their comeback, ATEEZ held a press conference to talk about their upc...",
      "description": "ATEEZ is gearing up for their highly-anticipated comeback with “GOLDEN HOUR : Part.4”! On February 5, ahead of their comeback, ATEEZ held a press conference to talk about their upcoming comeback with their 13th mini album “GOLDEN HOUR : Part.4.” Hongjoong began, “It’s our first album this year and our first album after renewing our… Continue reading Exclusive: ATEEZ Talks Contract Renewal, Favorite “Adrenaline” MV Scenes, Enlistment Duties, And More At “GOLDEN HOUR: Part.4” Press Conference The post Exclusive: ATEEZ Talks Contract Renewal, Favorite “Adrenaline” MV Scenes, Enlistment Duties, An...",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "comeback",
        "mini album",
        "album",
        "mv"
      ]
    },
    {
      "id": "640856f8966dde7a",
      "title": "The ‘BTS effect’ becomes reality in Seoul",
      "url": "https://www.koreaherald.com/article/10669622",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T05:59:40.000Z",
      "snippet": "With a little more than a month left until BTS’ historic return to the stage, Seoul is already feeling the heat. The group’s concert on March 21 at Gwanghwamun Square — their first...",
      "description": "With a little more than a month left until BTS’ historic return to the stage, Seoul is already feeling the heat. The group’s concert on March 21 at Gwanghwamun Square — their first full-group performance in over three years — has sent ripple effects through Seoul’s hospitality, retail and aviation industries, with nearby luxury hotels booked out and even budget motels hiking rates to nearly 500,000 won ($344) a night. Hotel industry data and tourism platforms show that the “BTS effect” is alread",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.d85707d318624b7ab7aa74d5084b44de_T1.jpg",
      "tags": [
        "concert",
        "bts"
      ]
    },
    {
      "id": "af242ab72befb734",
      "title": "Le Sserafim’s encore Seoul show — tightly choreographed to the last beat",
      "url": "https://www.koreaherald.com/article/10669577",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T05:18:14.000Z",
      "snippet": "Le Sserafim wrapped up its first world tour, “Easy Crazy Hot,” with a sold-out encore concert in Seoul on Sunday, closing a run that spanned 31 shows across 20 cities. Held at Jams...",
      "description": "Le Sserafim wrapped up its first world tour, “Easy Crazy Hot,” with a sold-out encore concert in Seoul on Sunday, closing a run that spanned 31 shows across 20 cities. Held at Jamsil Indoor Stadium, the final performance drew a near-capacity crowd, excluding limited-view seats. The tour, which began in Incheon in April last year, marked nearly a full year on the road for the group. Despite the demanding schedule, the members powered through a three-hour set featuring 26 songs, including original",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260203.d793e408b7b84e6b9d2b03104d563b72_T1.jpg",
      "tags": [
        "world tour",
        "concert",
        "le sserafim"
      ]
    },
    {
      "id": "82ef66d494a2bfa1",
      "title": "BTS logs 3m presaves on Spotify",
      "url": "https://www.koreaherald.com/article/10669476",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T03:21:29.000Z",
      "snippet": "The soon-to-be-released album from BTS amassed 3 million presaves on Spotify as of Wednesday. Its fifth full album “Arirang” has remained atop the platform's Countdown Chart Global...",
      "description": "The soon-to-be-released album from BTS amassed 3 million presaves on Spotify as of Wednesday. Its fifth full album “Arirang” has remained atop the platform's Countdown Chart Global for two weeks. The album will be available on March 20, a much-hyped return of the septet as a full group after more than 3 1/2 years away from the music scene. Fans have been listening to its old songs on repeat, pushing a number of them past milestones. “Yet To Come” from anthology album “Proof” and “Love Maze” from",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.9940a1d4b7a94a6083052dd62f30fb80_T1.jpg",
      "tags": [
        "album",
        "bts"
      ]
    },
    {
      "id": "f04b92b6858c8a7b",
      "title": "FTIsland to host first fan meetup in 10 years",
      "url": "https://www.koreaherald.com/article/10669467",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T02:55:14.000Z",
      "snippet": "FTIsland is planning to hold a fan meeting in Seoul on March 7, its first in a decade, its agency FNC Entertainment said Wednesday. The band uploaded a poster with a detective agen...",
      "description": "FTIsland is planning to hold a fan meeting in Seoul on March 7, its first in a decade, its agency FNC Entertainment said Wednesday. The band uploaded a poster with a detective agency theme, showing each of the three members dressed in suits. The event, dubbed “FT Agency,” also celebrates the three bandmates committing to the future of the group, having renewed contracts with the agency last week. The trio has been with the agency since the group's debut in 2007. Also on March 7, Lee Honggi will",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.26deea72d83f4eb4bfcafb0fbc618461_T1.jpg",
      "tags": [
        "debut",
        "fan meeting"
      ]
    },
    {
      "id": "162aa995748ea3ae",
      "title": "Riize to drop Japan single ahead of album release",
      "url": "https://www.koreaherald.com/article/10669407",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T02:22:59.000Z",
      "snippet": "Riize will give fans an early listen to its second single in Japan, unveiling the title track as a prerelease on Feb. 9, label SM Entertainment announced Wednesday. The group is se...",
      "description": "Riize will give fans an early listen to its second single in Japan, unveiling the title track as a prerelease on Feb. 9, label SM Entertainment announced Wednesday. The group is set to release its single album “All of You” on Feb. 18, but will drop the title track beforehand. Starting with Shotaro’s narration, the hip-hop tune is a confession of love to the group's fans, peppered with “saranghae,” meaning \"I love you\" in Korean. The upcoming single follows about 1 1/2 years after Riize's first s",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.db021ad91e7f4caf9e1cd927d905cd1c_T1.jpg",
      "tags": [
        "album",
        "riize"
      ]
    },
    {
      "id": "bd07cc9ecc50e4ec",
      "title": "Seoul city govt. plans for crowd control, anti-price gouging around BTS comeback show",
      "url": "https://www.koreaherald.com/article/10669358",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T02:10:13.000Z",
      "snippet": "The Seoul metropolitan government compiled a set of crowd control and anti-price-gouging measures Wednesday to effectively handle the large crowds expected to gather for K-pop grou...",
      "description": "The Seoul metropolitan government compiled a set of crowd control and anti-price-gouging measures Wednesday to effectively handle the large crowds expected to gather for K-pop group BTS' comeback show next month. During a meeting led by Seoul Mayor Oh Se-hoon, the city government discussed ways to prepare for the concert set to be held at Gwanghwamun Square on March 21. With tens of thousands of fans expected to converge on the square and its surrounding areas, the local government said it plans",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.79741b79a81d4677bc4d2281f401809e_T1.jpg",
      "tags": [
        "k-pop",
        "comeback",
        "concert",
        "bts"
      ]
    },
    {
      "id": "2d6173f8b8e43fd0",
      "title": "Twice subunit rolls out Japan LP",
      "url": "https://www.koreaherald.com/article/10669309",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T01:42:41.000Z",
      "snippet": "Twice’s subunit Misamo released its first studio album in Japan, “Play,” on Feb. 4, label JYP Entertainment announced Wednesday. Mina, Sana and Momo put out the LP as the final pie...",
      "description": "Twice’s subunit Misamo released its first studio album in Japan, “Play,” on Feb. 4, label JYP Entertainment announced Wednesday. Mina, Sana and Momo put out the LP as the final piece of an art-themed trilogy, following “Masterpiece” and “Haute Couture.” The former signaled the unit's debut in Japan in 2023, and the second EP came out in November 2024. The group's debut EP was the most-sold album from a female musician in Japan in 2023, and topped Oricon’s Daily and Weekly Album Rankings. The sec",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.c1a595822bfe43af84366fcbf4f99c2a_T1.jpg",
      "tags": [
        "debut",
        "album",
        "twice"
      ]
    },
    {
      "id": "d7a61dfe59eb1c76",
      "title": "Why Rose was unable to win a Grammy for ‘APT.’",
      "url": "https://www.koreaherald.com/article/10668687",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-03T05:42:18.000Z",
      "snippet": "Despite three nominations, Rose walked away from the 68th Grammy Awards empty-handed — a result that mirrors the uphill battle K-pop artists have long faced with the Recording Acad...",
      "description": "Despite three nominations, Rose walked away from the 68th Grammy Awards empty-handed — a result that mirrors the uphill battle K-pop artists have long faced with the Recording Academy. Rose is not the first K-pop artist to fall short of a Grammy win, starting with Psy’s nomination for best music video with “Gangnam Style” in 2012, as well as BTS’ nominations for best pop duo/group performance between 2021 and 2023. Ultimately, the Grammy Awards held firm in their reputation as one of the most co",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/03/news-p.v1.20260203.d4ffc7cb6cc441628fb5eaa7e93e7a11_T1.jpg",
      "tags": [
        "k-pop",
        "music video",
        "bts"
      ]
    },
    {
      "id": "d49aa9162ed4fd77",
      "title": "NCT’s Jeno, Jaemin float teaser for duo set",
      "url": "https://www.koreaherald.com/article/10668564",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-03T02:37:27.000Z",
      "snippet": "The countdown has begun for Jeno and Jaemin of NCT's first EP as a duo subunit, with release set for Feb. 23. SM Entertainment uploaded a poster detailing the timeline of teaser co...",
      "description": "The countdown has begun for Jeno and Jaemin of NCT's first EP as a duo subunit, with release set for Feb. 23. SM Entertainment uploaded a poster detailing the timeline of teaser content for “Both Sides” by NCT JNJM to NCT's social media channels Tuesday. On it, sheets of freshly printed paper tell fans when to expect everything from concept photograph drops to music video trailers in the lead-up to the release. Including the title track, the upcoming album will consist of six tracks. Separately,",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/03/news-p.v1.20260203.ffa054facdd64adb82bbda7db9793efc_T1.jpg",
      "tags": [
        "album",
        "music video",
        "nct"
      ]
    },
    {
      "id": "3577fc347c4599d0",
      "title": "Onew&apos;s 5th solo EP releases next month",
      "url": "https://www.koreaherald.com/article/10668460",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-03T02:06:10.000Z",
      "snippet": "Onew of Shinee is gearing up for a solo return on March 9, agency Griffin Entertainment announced Tuesday. The singer's fifth solo EP, “Tough Love,” comes about eight months after...",
      "description": "Onew of Shinee is gearing up for a solo return on March 9, agency Griffin Entertainment announced Tuesday. The singer's fifth solo EP, “Tough Love,” comes about eight months after his second album, “Percent.” The 11-track set topped the iTunes Top Albums chart in nine regions. Onew gave fans a taste of what is to come, unveiling a teaser video at his encore concert held in Seoul on Sunday as part of “Onew The Live: Percent.” Sunday's show was the finale of the monthslong tour, which was also the",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/03/news-p.v1.20260203.a405b5dbc1a049f1b36d70b1da812794_T1.jpg",
      "tags": [
        "album",
        "concert",
        "shinee"
      ]
    },
    {
      "id": "03a2537237e9c175",
      "title": "BTS’ Jin tops 800m on Spotify with solo single",
      "url": "https://www.koreaherald.com/article/10668438",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-03T01:54:36.000Z",
      "snippet": "Jin of BTS generated 800 million plays on Spotify with his solo “Don’t Say You Love Me” and amassed 10 million followers on the platform, according to label Big Hit Music on Tuesda...",
      "description": "Jin of BTS generated 800 million plays on Spotify with his solo “Don’t Say You Love Me” and amassed 10 million followers on the platform, according to label Big Hit Music on Tuesday. “Don’t Say You Love Me” is a soft R&B pop number tinged with retro vibes. Released in May as the lead single from his second solo album “Echo,” it ranked No. 90 on Billboard’s Hot 100 and was the first song by an Asian artist to claim No. 1 on Spotify’s Top Songs Global Chart in 2025. His EP “Echo” sat at No. 3 on t",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/03/news-p.v1.20260203.bd6b09c94de34fb7a0b3c5f1126a320c_T1.jpg",
      "tags": [
        "album",
        "billboard",
        "bts"
      ]
    },
    {
      "id": "f179ea82ae0f0e65",
      "title": "[Exclusive] Netflix to livestream BTS comeback show at Gwanghwamun Square on March 21",
      "url": "https://www.koreaherald.com/article/10668247",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-03T00:01:23.000Z",
      "snippet": "BTS’ long-awaited comeback performance at Gwanghwamun Square, Seoul, will be livestreamed globally on Netflix on March 21, an industry source confirmed Tuesday. The performance wil...",
      "description": "BTS’ long-awaited comeback performance at Gwanghwamun Square, Seoul, will be livestreamed globally on Netflix on March 21, an industry source confirmed Tuesday. The performance will be held as a one-day event with no additional shows planned, marking the group’s first full-group stage appearance in nearly four years. “BTS’ comeback show will take place only once, on March 21, at Gwanghwamun Square, and the performance will be broadcast live worldwide via Netflix,” the source told The Korea Heral",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/03/news-p.v1.20260203.96090c510e8943e2974364c5b62fa7af_T1.jpg",
      "tags": [
        "comeback",
        "bts"
      ]
    },
    {
      "id": "18e9bb558c0ba65c",
      "title": "‘Golden’ makes Grammy history — but not without questions",
      "url": "https://www.koreaherald.com/article/10667915",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-02T06:16:24.000Z",
      "snippet": "“Golden,” a soundtrack from Netflix’s animated film “KPop Demon Hunters,” marked a historic moment for the K-pop industry by becoming its first Grammy-winning song at the 68th Gram...",
      "description": "“Golden,” a soundtrack from Netflix’s animated film “KPop Demon Hunters,” marked a historic moment for the K-pop industry by becoming its first Grammy-winning song at the 68th Grammy Awards in Los Angeles, Sunday. The track won best song written for visual media, making it the first Grammy victory associated with K-pop — a milestone that even BTS, the genre’s most globally recognized act, failed to secure despite three previous nominations in different categories. The award is given to songwrite",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/02/news-p.v1.20260202.c848181db499490ba16b58aaabbe5cff_T1.jpg",
      "tags": [
        "k-pop",
        "kpop",
        "bts"
      ]
    },
    {
      "id": "2855afb078a201e3",
      "title": "Seventeen logs 300m views on YouTube for 1st time",
      "url": "https://www.koreaherald.com/article/10667725",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-02T02:53:55.000Z",
      "snippet": "Seventeen for the first time exceeded 300 million views for a music video with “Don’t Wanna Cry,” according to agency Pledis Entertainment on Monday. The video shot in Los Angeles...",
      "description": "Seventeen for the first time exceeded 300 million views for a music video with “Don’t Wanna Cry,” according to agency Pledis Entertainment on Monday. The video shot in Los Angeles adds depth to the song, portraying the emotions of a heartbroken boy. “Don’t Wanna Cry” is the focus track from the group's fourth EP “Al1” and earned the 13-member act six wins on local television music chart shows. The single entered Billboard’s World Digital Song Sales Chart at No. 3 while the mini album made its Wo",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/02/news-p.v1.20260202.a7d305d2c95a4ceeb5ec30e74332681c_T1.jpg",
      "tags": [
        "mini album",
        "album",
        "music video",
        "billboard",
        "seventeen"
      ]
    },
    {
      "id": "86a14044d210fc19",
      "title": "Rose, Bruno Mars open Grammys with hit single &apos;APT.&apos;",
      "url": "https://www.koreaherald.com/article/10667655",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-02T02:21:20.000Z",
      "snippet": "BLACKPINK's Rose has opened the 68th Grammy Awards with a high-energy performance of her global hit \"APT.,\" joined on stage by US pop star Bruno Mars. Performing at the Crypto.com...",
      "description": "BLACKPINK's Rose has opened the 68th Grammy Awards with a high-energy performance of her global hit \"APT.,\" joined on stage by US pop star Bruno Mars. Performing at the Crypto.com Arena in Los Angeles on Sunday night, the K-pop singer appeared in a white sleeveless top and tie, starting the lively set by planting a playful kiss on Mars' cheek as he played the guitar beside her. She then swayed to the rhythm before kneeling in front of him during the song's climactic bridge. The pair shared a sin",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/02/news-p.v1.20260202.bb81df4353fd45b59efdc4d81186a061_T1.jpg",
      "tags": [
        "k-pop",
        "blackpink"
      ]
    },
    {
      "id": "6e8ba65c78a9ec32",
      "title": "Stray Kids reach 100m views with ‘Ceremony’ music video",
      "url": "https://www.koreaherald.com/article/10667626",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-02T02:15:42.000Z",
      "snippet": "Stray Kids' \"Ceremony\" music video surpassed 100 million YouTube views on Sunday, their label JYP Entertainment said Monday. It is the group’s 18th music video to achieve the feat,...",
      "description": "Stray Kids' \"Ceremony\" music video surpassed 100 million YouTube views on Sunday, their label JYP Entertainment said Monday. It is the group’s 18th music video to achieve the feat, and cements their status as the fourth-generation boy group with the most music videos to do so. The video was unveiled in August, accompanying the main track from the group's fourth studio album “Karma.” The single hit Billboard’s Hot 100 at No. 52 as its fourth entry on the main songs chart. The LP landed atop Billb",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/02/news-p.v1.20260202.a4bac9869ad542f693bf0b09fa6351a7_T1.jpg",
      "tags": [
        "album",
        "music video",
        "billboard",
        "stray kids"
      ]
    }
  ]
}