{
  "generatedAt": "2026-02-15T10:57:33.913Z",
  "items": [
    {
      "id": "f46d54f366c67dcd",
      "title": "K-Pop Idol And Actor Couple Announce Pregnancy",
      "url": "https://www.koreaboo.com/news/9muses-keumjo-baek-kibeom-couple-announce-pregnancy/",
      "source": "Koreaboo",
      "publishedAt": "2026-02-15T04:02:45.000Z",
      "snippet": "Congratulations to the new mom and dad!",
      "description": "Congratulations to the new mom and dad!",
      "image": "https://image.koreaboo.com/2026/02/9muses-keumjo-pregnant-fi.jpg",
      "tags": [
        "k-pop",
        "idol"
      ]
    },
    {
      "id": "2db4e031ca845c19",
      "title": "BTS graces GQ magazine cover in 15 markets ahead of new album release",
      "url": "https://www.koreaherald.com/article/10676892",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-14T01:48:48.000Z",
      "snippet": "K-pop group BTS has graced the cover of GQ magazine's latest edition in 15 international markets ahead of the release of its fifth full-length album next month, its agency said Sat...",
      "description": "K-pop group BTS has graced the cover of GQ magazine's latest edition in 15 international markets ahead of the release of its fifth full-length album next month, its agency said Saturday. According to BigHit Music, BTS has been selected as the cover model for the March issue of the men's fashion magazine in 15 countries and regions, including South Korea, the United States, Britain, Japan, Mexico, Germany and Thailand. The agency said it marked the first time a Korean artist has simultaneously ap",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/14/news-a.v1.20260214.bc634c069bb1462298cd99b118ae472d_T1.png",
      "tags": [
        "k-pop",
        "album",
        "bts"
      ]
    },
    {
      "id": "e5cc7ead5101dee6",
      "title": "Watch: ATEEZ Takes 2nd Win For “Adrenaline” On “Music Bank”; Performances By IVE, TWS, And More",
      "url": "https://www.soompi.com/article/1819390wpp/watch-ateez-takes-2nd-win-for-adrenaline-on-music-bank-performances-by-ive-tws-and-more",
      "source": "Soompi",
      "publishedAt": "2026-02-13T17:36:17.000Z",
      "snippet": "ATEEZ has taken their second win for “Adrenaline”! On the February 13 episode of “Music Bank,” ATEEZ’s “Adrenaline” was announced as the winner with 14,413 points over 3,953 points...",
      "description": "ATEEZ has taken their second win for “Adrenaline”! On the February 13 episode of “Music Bank,” ATEEZ’s “Adrenaline” was announced as the winner with 14,413 points over 3,953 points for KiiiKiii’s “404 (New Era).” Congratulations to ATEEZ! This week’s “Music Bank” featured performances by ATEEZ, AxMxP, dodree, IVE, KiiiKiii, MADEIN, POW, TWS, Kim Jang Hoon,… Continue reading Watch: ATEEZ Takes 2nd Win For “Adrenaline” On “Music Bank”; Performances By IVE, TWS, And More The post Watch: ATEEZ Takes 2nd Win For “Adrenaline” On “Music Bank”; Performances By IVE, TWS, And More appeared first on Soom...",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/13093602/ateez_54a1da.jpeg",
      "tags": [
        "music bank",
        "ive"
      ]
    },
    {
      "id": "583bd0ad2e9088e9",
      "title": "TWICE Extends Record As Girl Group With Most MVs To Surpass 100 Million Views With “THIS IS FOR”",
      "url": "https://www.soompi.com/article/1819239wpp/twice-extends-record-as-girl-group-with-most-mvs-to-surpass-100-million-views-with-this-is-for",
      "source": "Soompi",
      "publishedAt": "2026-02-13T01:07:15.000Z",
      "snippet": "TWICE has achieved yet another YouTube milestone! On February 13 at approximately 9 a.m. KST, the girl group’s music video for “THIS IS FOR” surpassed 100 million views on YouTube,...",
      "description": "TWICE has achieved yet another YouTube milestone! On February 13 at approximately 9 a.m. KST, the girl group’s music video for “THIS IS FOR” surpassed 100 million views on YouTube, meaning that it took approximately seven months, one day, and 20 hours to achieve the feat since its release on July 11, 2025 at 1… Continue reading TWICE Extends Record As Girl Group With Most MVs To Surpass 100 Million Views With “THIS IS FOR” The post TWICE Extends Record As Girl Group With Most MVs To Surpass 100 Million Views With “THIS IS FOR” appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/12165306/Screenshot-2026-02-13-at-9.36.28-AM.png",
      "tags": [
        "music video",
        "twice"
      ]
    },
    {
      "id": "8ecdb44d93faf56b",
      "title": "BTS to stream new world tour shows in cinemas worldwide",
      "url": "https://www.koreaherald.com/article/10676096",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-12T23:54:34.000Z",
      "snippet": "K-pop giant BTS will livestream the opening shows of its new world tour \"Arirang\" in cinemas across South Korea and around the world, its agency BigHit Music said Friday. The scree...",
      "description": "K-pop giant BTS will livestream the opening shows of its new world tour \"Arirang\" in cinemas across South Korea and around the world, its agency BigHit Music said Friday. The screenings will feature the band's concerts in Goyang, just northwest of Seoul, on April 11 and in Tokyo on April 18 at more than 3,500 theaters in 75 countries. Some regions will show delayed broadcasts due to time differences, the company said. In South Korea, leading multiplex chains CGV, Lotte Cinema and Megabox will ho",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/13/rcv.YNA.20260122.PYH2026012207610001300_T1.jpg",
      "tags": [
        "k-pop",
        "world tour",
        "bts"
      ]
    },
    {
      "id": "5ab433246126c485",
      "title": "National Museum of Korea goes pink for Blackpink&apos;s comeback",
      "url": "https://www.koreaherald.com/article/10675708",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-12T06:02:57.000Z",
      "snippet": "Blackpink is expanding beyond music into cultural heritage to mark the Feb. 27 release of its third EP “Deadline,” becoming the first K-pop act to carry out an official large-scale...",
      "description": "Blackpink is expanding beyond music into cultural heritage to mark the Feb. 27 release of its third EP “Deadline,” becoming the first K-pop act to carry out an official large-scale collaboration with the National Museum of Korea. According to YG Entertainment on Thursday, “National Museum of Korea x Blackpink” rolls out from Feb. 26 to March. 8, in partnership with the museum and global audio streaming platform, Spotify. During the project, the museum’s exterior will be illuminated in pink as pa",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/12/news-p.v1.20260212.f66f73cb42f04af6a1d810939d33f813_T1.jpg",
      "tags": [
        "k-pop",
        "comeback",
        "blackpink"
      ]
    },
    {
      "id": "d6bf925454181351",
      "title": "BTS’ V scores 2.5b plays on Spotify with solo set",
      "url": "https://www.koreaherald.com/article/10675445",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-12T02:27:45.000Z",
      "snippet": "V of BTS exceeded 2.5 billion plays on Spotify with his first solo album, “Layover,” according to Big Hit Music on Thursday. The album rolled out in September 2023 and reached the...",
      "description": "V of BTS exceeded 2.5 billion plays on Spotify with his first solo album, “Layover,” according to Big Hit Music on Thursday. The album rolled out in September 2023 and reached the milestone on Wednesday, nearly 2 1/2 years later. The album debuted on the Billboard 200 at No. 2 and all six of its tracks made the Global 200 and Global Excl. US charts, in a first for a K-pop solo endeavor. Each track garnered more than 100 million streams on Spotify, another first for such a release. The mini album",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/12/news-p.v1.20260212.18fded7e8531493980c9a7dbb632d68c_T1.jpg",
      "tags": [
        "k-pop",
        "mini album",
        "album",
        "billboard",
        "bts"
      ]
    },
    {
      "id": "f578659de9b739d1",
      "title": "Twice reaches 900m views for 1st time with ‘What is Love?’ video",
      "url": "https://www.koreaherald.com/article/10675367",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-12T01:49:01.000Z",
      "snippet": "Twice's music video for “What is Love?” has passed 900 million views on YouTube, a first for the group, label JYP Entertainment said Thursday. The video was released in April 2018...",
      "description": "Twice's music video for “What is Love?” has passed 900 million views on YouTube, a first for the group, label JYP Entertainment said Thursday. The video was released in April 2018 for the title track from the group's fifth EP. In it, each of the nine members becomes a character from a well-known movie and visualizes their ideas of love. The six-track EP sold over 100,000 copies in the first week, the fourth-most for a K-pop girl group at the time. Twice is in the middle of the North American leg",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/12/news-p.v1.20260212.0c553aa6c2154d9f8ffd2898892d57c6_T1.jpg",
      "tags": [
        "k-pop",
        "music video",
        "twice"
      ]
    },
    {
      "id": "1d2b6264ed9825de",
      "title": "Nmixx becomes first K-pop act to perform at Brazilian Carnival in Sao Paulo",
      "url": "https://www.koreaherald.com/article/10674838",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T07:30:00.000Z",
      "snippet": "Nmixx is set to become the first-ever K-pop artist to perform at the Brazilian Carnival, one of the world’s largest and most iconic festivals. According to JYP Entertainment, Nmixx...",
      "description": "Nmixx is set to become the first-ever K-pop artist to perform at the Brazilian Carnival, one of the world’s largest and most iconic festivals. According to JYP Entertainment, Nmixx will take the stage at the Brazilian Carnival Sao Paulo, scheduled for Feb. 14 to 18. The group will appear as a special guest on Feb. 16 at a block party hosted by Brazilian pop star Pabllo Vittar — one of the main carnival festivities. The term “block party” refers to large-scale street celebrations that are a hallm",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260211.97720f3bd9294b23b2fa13b6ec72cf98_T1.jpeg",
      "tags": [
        "k-pop",
        "nmixx"
      ]
    },
    {
      "id": "63da7ff8cac33cfa",
      "title": "G-Dragon to make Middle East debut",
      "url": "https://www.koreaherald.com/article/10674747",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T06:31:11.000Z",
      "snippet": "G-Dragon is set to make his Middle East performance debut at the “Krazy Super Concert,” scheduled for Feb. 17 at Dubai Media City Amphitheater in the United Arab Emirates. The conc...",
      "description": "G-Dragon is set to make his Middle East performance debut at the “Krazy Super Concert,” scheduled for Feb. 17 at Dubai Media City Amphitheater in the United Arab Emirates. The concert marks the K-pop icon’s first official appearance in the region since his debut. “Krazy Super Concert,” which previously sold out in New York and Los Angeles, is expanding into the Middle East for the first time. The event is organized by Pu1se Events, an international EDM brand founded by Chinese entrepreneur Luffy",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260211.040539c12f1248f4b64257198ea33f0b_T1.jpg",
      "tags": [
        "k-pop",
        "debut",
        "concert"
      ]
    },
    {
      "id": "c862792381eb6fa3",
      "title": "15,000 invited to BTS’ free Gwanghwamun concert — how can the rest watch?",
      "url": "https://www.koreaherald.com/article/10674717",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T06:12:37.000Z",
      "snippet": "BTS' free concert at Gwanghwamun Square in March will have 15,000 invited fans, organizers said Wednesday. But how can those in Seoul without a ticket watch? The question has been...",
      "description": "BTS' free concert at Gwanghwamun Square in March will have 15,000 invited fans, organizers said Wednesday. But how can those in Seoul without a ticket watch? The question has been raised as an estimated 260,000 people are projected to gather near the venue — more than 11 times the square’s official capacity of 18,000. For fans who were not among the 15,000 ticket holders, the concert will be broadcast live on large digital billboards installed on buildings surrounding Gwanghwamun Square, in cent",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/12/news-p.v1.20260211.6c40b6e41fce4d2892d5cf56ded478b7_T1.jpg",
      "tags": [
        "concert",
        "bts"
      ]
    },
    {
      "id": "4eda54c024435d6e",
      "title": "Stray Kids&apos; concert movie turns into a global box-office event",
      "url": "https://www.koreaherald.com/article/10674682",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T05:51:55.000Z",
      "snippet": "Sixty-one countries, $19 million in one weekend. The men delivered. \"Stray Kids: The Dominate Experience,\" the concert movie built around the eight-member boy band's gig at Los Ang...",
      "description": "Sixty-one countries, $19 million in one weekend. The men delivered. \"Stray Kids: The Dominate Experience,\" the concert movie built around the eight-member boy band's gig at Los Angeles' SoFi Stadium last year, opened Friday and promptly did something no K-pop release has managed before: top the global weekend box office. A sold-out world tour is one thing. Topping the global box office is another. The film grossed $19.1 million across 61 territories in its opening weekend, according to the group",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260211.bc1725421847455db620cb3deed394a7_T1.jpg",
      "tags": [
        "k-pop",
        "world tour",
        "concert",
        "stray kids"
      ]
    },
    {
      "id": "aff5e0bbd02274d1",
      "title": "Enhypen extends stay on Billboard 200",
      "url": "https://www.koreaherald.com/article/10674541",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T02:51:47.000Z",
      "snippet": "Enhypen is spending its third consecutive week on the Billboard 200 with its seventh EP “The Sin: Vanish,” according to the chart published Tuesday in the US. The mini album debute...",
      "description": "Enhypen is spending its third consecutive week on the Billboard 200 with its seventh EP “The Sin: Vanish,” according to the chart published Tuesday in the US. The mini album debuted at No. 2 and ranked No. 48 on the latest chart. It is the group’s ninth entry on the main albums chart and sixth straight album to rank among the top ten. The 11-track endeavor sold more than 2 million copies in the first week and became Enhypen's fourth to do so. It logged over 250,000 shipments in Japan as of Janua",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260211.d2b15777df9f4bf7bf79dab9fa6dc1b6_T1.jpg",
      "tags": [
        "mini album",
        "album",
        "billboard"
      ]
    },
    {
      "id": "a748908ac41194b8",
      "title": "Cortis to return in April",
      "url": "https://www.koreaherald.com/article/10674321",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T01:21:31.000Z",
      "snippet": "Cortis will release a new album in April, said label Big Hit Music, confirming a local media report published Tuesday. The boy band's return comes about eight months after releasin...",
      "description": "Cortis will release a new album in April, said label Big Hit Music, confirming a local media report published Tuesday. The boy band's return comes about eight months after releasing its debut album “Color Outside the Lines.” The first EP sold more than 436,000 copies in the first week and had sold over 1.3 million copies as of December last year, the fourth-most and the second-most for a debut album from a K-pop boy group, respectively. The five-track set entered the Billboard 200 at No. 15 and",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260211.ca72b505c4d54cafb4cc532dc63c7df9_T1.jpg",
      "tags": [
        "k-pop",
        "debut",
        "album",
        "billboard"
      ]
    },
    {
      "id": "472e0d34b078a928",
      "title": "From rookies to global acts, K-pop increasingly turns to electronic music",
      "url": "https://www.koreaherald.com/article/10673810",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-10T06:51:50.000Z",
      "snippet": "An increasing number of K-pop acts are leaning into electronic music, signaling what could emerge as one of the genre’s defining sonic currents this year. From rookie groups such a...",
      "description": "An increasing number of K-pop acts are leaning into electronic music, signaling what could emerge as one of the genre’s defining sonic currents this year. From rookie groups such as KiiiKiii to established acts including Ive and Blackpink, artists are selecting house or electronic dance tracks as their lead singles. Even BTS is reported to have collaborated with American DJ and producer Diplo on its upcoming album “Arirang,” due March 20, further fueling expectations around an EDM-driven directi",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260210.38c1b823e5e042bc8da2370b417090c9_T1.jpg",
      "tags": [
        "k-pop",
        "album",
        "bts",
        "blackpink",
        "ive"
      ]
    },
    {
      "id": "777159c9edc5f7c1",
      "title": "Le Sserafim tops Oricon singles chart",
      "url": "https://www.koreaherald.com/article/10673569",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-10T02:45:00.000Z",
      "snippet": "Le Sserafim claimed the No. 1 spot on Oricon’s Weekly Single Ranking with “Spaghetti,” according to the chart published Tuesday. This is the first time in three years an internatio...",
      "description": "Le Sserafim claimed the No. 1 spot on Oricon’s Weekly Single Ranking with “Spaghetti,” according to the chart published Tuesday. This is the first time in three years an international female act sat atop the chart. The five-member group nabbed the highest rung on the chart three months after the album release, notching the spot it landed in 2023 with its Japan debut single “Fearless.” The chart success owes to the quintet’s first international tour, “Easy Crazy Hot,” which saw it play the Tokyo",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/10/news-p.v1.20260210.a4021eea0dd9494d9793031cfbb0c21c_T1.jpg",
      "tags": [
        "debut",
        "album",
        "le sserafim"
      ]
    },
    {
      "id": "829e6c2e4c6fb6a7",
      "title": "Seventeen’s DK, Seungkwan certified gold in Japan",
      "url": "https://www.koreaherald.com/article/10673407",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-10T01:55:55.000Z",
      "snippet": "DK and Seungkwan of Seventeen certified gold in Japan with their first EP “Serenade,” agency Pledis Entertainment announced Tuesday, citing the Recording Industry Association of Ja...",
      "description": "DK and Seungkwan of Seventeen certified gold in Japan with their first EP “Serenade,” agency Pledis Entertainment announced Tuesday, citing the Recording Industry Association of Japan. The mini album logged more than 100,000 shipments, making the duo Seventeen's third subunit to earn gold certification, following Junghan and Wonwoo, and S.Coups and Mingyu. As a full group, Seventeen has achieved the feat with 18 of its albums. The EP landed atop Oricon’s Daily Album Ranking and remains at No. 1",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/10/news-p.v1.20260210.0d3a56152137437e8468bd2efe829e57_T1.jpg",
      "tags": [
        "mini album",
        "album",
        "seventeen"
      ]
    },
    {
      "id": "f11e3ef27512e819",
      "title": "Stray Kids to celebrate 8 years together with fans",
      "url": "https://www.koreaherald.com/article/10673381",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-10T01:38:13.000Z",
      "snippet": "Stray Kids will meet and greet fans in person through four days of fan meetings, JYP Entertainment announced Monday. The eight bandmates will celebrate the eighth anniversary of th...",
      "description": "Stray Kids will meet and greet fans in person through four days of fan meetings, JYP Entertainment announced Monday. The eight bandmates will celebrate the eighth anniversary of their debut with the event, titled “Stay in Our Little House,” at Incheon Inspire Arena. \"Stay\" is the group’s official fandom community. The fan meetups will be held on March 28-29 and April 4-5. The second and fourth events will be broadcast online. Separately, the group's tour film “Stray Kids: The Dominate Experience",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/10/news-p.v1.20260210.85ee71fcd38746a4817af3fa99d6ac83_T1.jpg",
      "tags": [
        "debut",
        "fan meeting",
        "stray kids"
      ]
    },
    {
      "id": "82b807507a0605e8",
      "title": "BTS’ comeback reshapes Hybe&apos;s release calendar",
      "url": "https://www.koreaherald.com/article/10672824",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-09T06:10:10.000Z",
      "snippet": "As BTS prepares to release its highly anticipated new album “Arirang” on March 20, other K-pop acts planning comebacks around the same period are recalibrating their schedules to n...",
      "description": "As BTS prepares to release its highly anticipated new album “Arirang” on March 20, other K-pop acts planning comebacks around the same period are recalibrating their schedules to navigate the ripple effects of the group’s return. Within Hybe, which houses BTS’ agency Big Hit Music, affiliated labels are moving in strategic alignment with the comeback. Rather than avoiding the period altogether, some groups are timing their releases to benefit from heightened attention on K-pop as a whole — a so-",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260209.b30942423aa044acbef8ba696729bdd8_T1.jpg",
      "tags": [
        "k-pop",
        "comeback",
        "album",
        "bts"
      ]
    },
    {
      "id": "690a295d05372751",
      "title": "Army, get ready: BTS Gwanghwamun comeback show tickets drop Feb. 23",
      "url": "https://www.koreaherald.com/article/10672661",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-09T04:05:23.000Z",
      "snippet": "BTS unveiled ticketing details for their highly anticipated comeback performance at Gwanghwamun Square in central Seoul — the group’s first live appearance in more than three years...",
      "description": "BTS unveiled ticketing details for their highly anticipated comeback performance at Gwanghwamun Square in central Seoul — the group’s first live appearance in more than three years. On Monday, Big Hit Music announced through global fan platform Weverse that BTS The Comeback Live: Arirang will take place at 8 p.m. on March 21. The seven-member group will perform fan-favorites as well as new songs from their upcoming fifth album, “Arirang,” which will be released a day earlier on March 20. The con",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/09/news-p.v1.20260209.9a46a6b0d30b46839b6f6b7ba7be22c7_T1.jpg",
      "tags": [
        "comeback",
        "album",
        "bts"
      ]
    },
    {
      "id": "1125941dc1cf184a",
      "title": "H1-Key to bring out 5th EP next month",
      "url": "https://www.koreaherald.com/article/10672537",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-09T02:15:19.000Z",
      "snippet": "Girl group H1-Key will release its fifth mini album, \"Love Chapter,\" on March 5, Choi Creative Lab announced Monday. The upcoming EP will be its first new release in about nine mon...",
      "description": "Girl group H1-Key will release its fifth mini album, \"Love Chapter,\" on March 5, Choi Creative Lab announced Monday. The upcoming EP will be its first new release in about nine months, coming on the heels of the previous EP \"Lovestruck.\" The last release might have been slow in terms of album sales, but focus track \"Summer Was You\" made a series of best songs lists, ranking No. 6 on NME's \"The 25 Best K-pop Songs of 2025\" and No. 10 on Billboard's ranking. \"Coupled with a soaring and infectious",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/09/news-p.v1.20260209.527392cebd684e84b58aba40e0f5277d_T1.jpg",
      "tags": [
        "k-pop",
        "mini album",
        "album",
        "billboard"
      ]
    },
    {
      "id": "d82379de63ce77fe",
      "title": "Blackpink&apos;s Jisoo hits 100m views on &apos;Earthquake&apos; video",
      "url": "https://www.koreaherald.com/article/10672496",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-09T01:59:55.000Z",
      "snippet": "Jisoo of Blackpink reached the milestone of 100 million views on YouTube with the music video for \"Earthquake\" as of Saturday, according to her agency Blissoo. The video for the fo...",
      "description": "Jisoo of Blackpink reached the milestone of 100 million views on YouTube with the music video for \"Earthquake\" as of Saturday, according to her agency Blissoo. The video for the focus track from her first solo EP, \"Amortage,\" was released in February last year. The single ranked No. 47 on the Billboard Global 200 chart and No. 22 on the Global 200 Excl. US chart. It topped Billboard's World Digital Song Sales Chart. The four-track set debuted atop iTunes albums charts in 45 regions and sold more",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/09/news-p.v1.20260209.560eef7587234fecab37cd3bbab4122e_T1.jpg",
      "tags": [
        "music video",
        "billboard",
        "blackpink"
      ]
    },
    {
      "id": "d6f0abee028d64fb",
      "title": "BTS achieves highest single-show capacity at Tottenham Hotspur Stadium",
      "url": "https://www.koreaherald.com/article/10672047",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-08T06:20:00.000Z",
      "snippet": "BTS is set to achieve another milestone at the Tottenham Hotspur Stadium in London, with the highest-ever audience capacity for a single concert at the venue, according to Live Nat...",
      "description": "BTS is set to achieve another milestone at the Tottenham Hotspur Stadium in London, with the highest-ever audience capacity for a single concert at the venue, according to Live Nation UK. Via its social media channels, the British concert promoter announced that BTS’ fandom, Army, would “create highest single show capacity” to date for the group’s upcoming concert at the venue. BTS is scheduled to hold two shows at Tottenham Hotspur Stadium on July 6 and 7, with an estimated 120,000 fans attendi",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/08/news-p.v1.20260208.51837ba74fb34eab83af00fbe05225fb_T1.jpg",
      "tags": [
        "concert",
        "bts"
      ]
    },
    {
      "id": "adb33fd5d914148f",
      "title": "Blackpink, Ive to face off for chart success in late February",
      "url": "https://www.koreaherald.com/article/10672006",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-08T04:15:44.000Z",
      "snippet": "A grand face-off in K-pop is on the horizon, as two of the industry’s most prominent girl groups — Blackpink and Ive — are gearing up for back-to-back releases late this month. Wit...",
      "description": "A grand face-off in K-pop is on the horizon, as two of the industry’s most prominent girl groups — Blackpink and Ive — are gearing up for back-to-back releases late this month. With only four days separating the two groups’ respective returns, K-pop fans are anticipating a head-to-head battle on the charts, pitting one of the most globally recognized acts against a leading fourth-generation girl group, each of them known for consistently putting out hits. On Feb. 27, Blackpink will release its t",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/08/news-p.v1.20260208.03b256622e6647af8cc0f5ad05657179_T1.jpg",
      "tags": [
        "k-pop",
        "blackpink",
        "ive"
      ]
    },
    {
      "id": "58877928ba54ffd9",
      "title": "BTS to turn Seoul into cultural stage with ‘The City Seoul’",
      "url": "https://www.koreaherald.com/article/10671570",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T08:58:18.000Z",
      "snippet": "BTS will be extending its comeback celebrations beyond the stage and into Seoul itself as it transforms the city into a massive, immersive cultural venue this spring. “BTS The City...",
      "description": "BTS will be extending its comeback celebrations beyond the stage and into Seoul itself as it transforms the city into a massive, immersive cultural venue this spring. “BTS The City Arirang Seoul,” launching March 20 and running through April 12, is a citywide project marking the release of BTS' fifth album “Arirang,” agency Big Hit Music announced Thursday. The event will also follow the group's comeback show, “BTS Comeback Live: Arirang,” set for Gwanghwamun Square in central Seoul. “In collabo",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.d925ef6a4e274eb5a3a815bf17920244_T1.jpg",
      "tags": [
        "comeback",
        "album",
        "bts"
      ]
    },
    {
      "id": "7e0e36b3f30ef908",
      "title": "Blackpink unveils tracklist for new EP, with ‘Go’ as main track",
      "url": "https://www.koreaherald.com/article/10671525",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T07:47:05.000Z",
      "snippet": "Blackpink has revealed the tracklist for its upcoming third EP “Deadline,” marking the group’s first full-member release in approximately three years and five months. According to...",
      "description": "Blackpink has revealed the tracklist for its upcoming third EP “Deadline,” marking the group’s first full-member release in approximately three years and five months. According to YG Entertainment on Friday, the new album will feature five tracks: pre-release single “Jump,” main track “Go,” as well as B-side tracks “Me and My,” “Champion” and “Fxxxboy.” YG describes the album as a snapshot of the girl group at its peak. “As the title ‘Deadline’ suggests, the album will be filled with Blackpink’s",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.48bdab8d2b56437ebd6a0774a9d1fe3d_T1.jpg",
      "tags": [
        "album",
        "blackpink"
      ]
    },
    {
      "id": "35a8de7b70c4c89d",
      "title": "Hearts2Hearts to drop new single",
      "url": "https://www.koreaherald.com/article/10671169",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T02:05:32.000Z",
      "snippet": "Rookie girl group Hearts2Hearts is poised to release a single, label SM Entertainment said Friday. The group will drop “Rude!” on Feb. 20, about four months after its first EP, “Fo...",
      "description": "Rookie girl group Hearts2Hearts is poised to release a single, label SM Entertainment said Friday. The group will drop “Rude!” on Feb. 20, about four months after its first EP, “Focus.” It debuted in February 2025 with “The Chase” and added the digital single “Style” in June, followed by a mini album in October. The group took home seven rookie awards by the end of the year and was a candidate for best new artist (K-pop) at the 2026 iHeartRadio Music Awards. On Feb. 21-22, the eight members will",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.976c9b841f9a4797bedc2de042e8e592_T1.jpg",
      "tags": [
        "k-pop",
        "mini album",
        "album"
      ]
    },
    {
      "id": "e92e22d9ab2edc96",
      "title": "Ive announces March fan concert",
      "url": "https://www.koreaherald.com/article/10671103",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T01:23:02.000Z",
      "snippet": "Ive will hold its fourth fan concert March 21-22 in Incheon, its agency Starship Entertainment announced Thursday. The second day’s event will be broadcast online to reach more fan...",
      "description": "Ive will hold its fourth fan concert March 21-22 in Incheon, its agency Starship Entertainment announced Thursday. The second day’s event will be broadcast online to reach more fans. The group of six named the two-date event “Ive into Dive,” emphasizing its connection with fans. Dive is the name of its official fandom community. At the fan concert, Ive is expected to perform new songs from its second studio album “Revive+” which is due out on Feb. 23. On Monday, the group will drop the B-side tr",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.6bdcc8bed9fe4aebbc26ec7676fb0d56_T1.jpg",
      "tags": [
        "album",
        "concert",
        "ive"
      ]
    },
    {
      "id": "640856f8966dde7a",
      "title": "The ‘BTS effect’ becomes reality in Seoul",
      "url": "https://www.koreaherald.com/article/10669622",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T05:59:40.000Z",
      "snippet": "With a little more than a month left until BTS’ historic return to the stage, Seoul is already feeling the heat. The group’s concert on March 21 at Gwanghwamun Square — their first...",
      "description": "With a little more than a month left until BTS’ historic return to the stage, Seoul is already feeling the heat. The group’s concert on March 21 at Gwanghwamun Square — their first full-group performance in over three years — has sent ripple effects through Seoul’s hospitality, retail and aviation industries, with nearby luxury hotels booked out and even budget motels hiking rates to nearly 500,000 won ($344) a night. Hotel industry data and tourism platforms show that the “BTS effect” is alread",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.d85707d318624b7ab7aa74d5084b44de_T1.jpg",
      "tags": [
        "concert",
        "bts"
      ]
    },
    {
      "id": "af242ab72befb734",
      "title": "Le Sserafim’s encore Seoul show — tightly choreographed to the last beat",
      "url": "https://www.koreaherald.com/article/10669577",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T05:18:14.000Z",
      "snippet": "Le Sserafim wrapped up its first world tour, “Easy Crazy Hot,” with a sold-out encore concert in Seoul on Sunday, closing a run that spanned 31 shows across 20 cities. Held at Jams...",
      "description": "Le Sserafim wrapped up its first world tour, “Easy Crazy Hot,” with a sold-out encore concert in Seoul on Sunday, closing a run that spanned 31 shows across 20 cities. Held at Jamsil Indoor Stadium, the final performance drew a near-capacity crowd, excluding limited-view seats. The tour, which began in Incheon in April last year, marked nearly a full year on the road for the group. Despite the demanding schedule, the members powered through a three-hour set featuring 26 songs, including original",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260203.d793e408b7b84e6b9d2b03104d563b72_T1.jpg",
      "tags": [
        "world tour",
        "concert",
        "le sserafim"
      ]
    }
  ]
}