{
  "generatedAt": "2026-02-11T19:38:50.613Z",
  "items": [
    {
      "id": "4c3f98c5957409ff",
      "title": "BTS’s Comeback Shockingly Triggers Printing Paper Shortage In Korea",
      "url": "https://www.koreaboo.com/news/bts-printing-paper-shortage-arirang-album/",
      "source": "Koreaboo",
      "publishedAt": "2026-02-11T15:53:36.000Z",
      "snippet": "Their influence is crazy! 👑",
      "description": "Their influence is crazy! 👑",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "comeback",
        "bts"
      ]
    },
    {
      "id": "0595de20f23b2057",
      "title": "TWICE’s Dahyun To Sit Out From “THIS IS FOR World Tour” Due To Health Concerns",
      "url": "https://www.koreaboo.com/news/twice-dahyun-ankle-fracture/",
      "source": "Koreaboo",
      "publishedAt": "2026-02-11T14:29:34.000Z",
      "snippet": "Fans hope for her quick recovery.",
      "description": "Fans hope for her quick recovery.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "world tour",
        "twice"
      ]
    },
    {
      "id": "00f1eab35a3e5d79",
      "title": "2026 Philippines K-Pop Tour Masterlist: Concerts, Fan Meetings, And More",
      "url": "https://www.soompi.com/article/1818491wpp/2026-philippines-k-pop-tour-masterlist-concerts-fan-meetings-and-more",
      "source": "Soompi",
      "publishedAt": "2026-02-11T07:36:08.000Z",
      "snippet": "For K-pop fans in the Philippines, get ready to see an exciting lineup of K-pop stars at concerts, fan meetings, and fan-cons in 2026! This comprehensive masterlist is your ultimat...",
      "description": "For K-pop fans in the Philippines, get ready to see an exciting lineup of K-pop stars at concerts, fan meetings, and fan-cons in 2026! This comprehensive masterlist is your ultimate guide to every K-pop tour visiting the Philippines in 2026, ensuring you won’t miss a chance to see your favorite stars. Here are K-pop events… Continue reading 2026 Philippines K-Pop Tour Masterlist: Concerts, Fan Meetings, And More The post 2026 Philippines K-Pop Tour Masterlist: Concerts, Fan Meetings, And More appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/10210808/svt.jpeg",
      "tags": [
        "k-pop",
        "fan meeting"
      ]
    },
    {
      "id": "c862792381eb6fa3",
      "title": "15,000 invited to BTS’ free Gwanghwamun concert — how can the rest watch?",
      "url": "https://www.koreaherald.com/article/10674717",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T06:12:37.000Z",
      "snippet": "BTS' free concert at Gwanghwamun Square in March will have 15,000 invited fans, organizers said Wednesday. But how can those in Seoul without a ticket watch? The question has been...",
      "description": "BTS' free concert at Gwanghwamun Square in March will have 15,000 invited fans, organizers said Wednesday. But how can those in Seoul without a ticket watch? The question has been raised as an estimated 260,000 people are projected to gather near the venue — more than 11 times the square’s official capacity of 18,000. For fans who were not among the 15,000 ticket holders, the concert will be broadcast live on large digital billboards installed on buildings surrounding Gwanghwamun Square, in cent",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260211.6c40b6e41fce4d2892d5cf56ded478b7_T1.jpg",
      "tags": [
        "concert",
        "bts"
      ]
    },
    {
      "id": "1e26d8eea94bef40",
      "title": "TWICE’s Dahyun To Take Hiatus From “THIS IS FOR” Tour Due To Injury",
      "url": "https://www.soompi.com/article/1818775wpp/twices-dahyun-to-take-hiatus-from-this-is-for-tour-due-to-injury",
      "source": "Soompi",
      "publishedAt": "2026-02-11T05:46:53.000Z",
      "snippet": "Dahyun will be unable to participate in upcoming concert stops for TWICE’s world tour “THIS IS FOR” after sustaining an ankle injury. On February 11, JYP Entertainment issued an of...",
      "description": "Dahyun will be unable to participate in upcoming concert stops for TWICE’s world tour “THIS IS FOR” after sustaining an ankle injury. On February 11, JYP Entertainment issued an official statement announcing that Dahyun will be unable to participate in the North America tour dates scheduled from February 13 through March 7. Read the full… Continue reading TWICE’s Dahyun To Take Hiatus From “THIS IS FOR” Tour Due To Injury The post TWICE’s Dahyun To Take Hiatus From “THIS IS FOR” Tour Due To Injury appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/10214338/dahyun-1-.jpeg",
      "tags": [
        "world tour",
        "concert",
        "twice"
      ]
    },
    {
      "id": "ce350b5199e523ab",
      "title": "TWICE’s “What Is Love?” Becomes Their 1st MV To Hit 900 Million Views",
      "url": "https://www.soompi.com/article/1818587wpp/twices-what-is-love-becomes-their-1st-mv-to-hit-900-million-views",
      "source": "Soompi",
      "publishedAt": "2026-02-11T03:37:31.000Z",
      "snippet": "TWICE is inching closer towards hitting the 1 billion mark on YouTube! On February 11 at approximately 12:35 p.m. KST, TWICE’s music video for “What is Love?” surpassed 900 million...",
      "description": "TWICE is inching closer towards hitting the 1 billion mark on YouTube! On February 11 at approximately 12:35 p.m. KST, TWICE’s music video for “What is Love?” surpassed 900 million views on YouTube, making it the group’s first music video ever to reach the milestone. TWICE originally released “What is Love?” on April 9, 2018… Continue reading TWICE’s “What Is Love?” Becomes Their 1st MV To Hit 900 Million Views The post TWICE’s “What Is Love?” Becomes Their 1st MV To Hit 900 Million Views appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/10074700/TWICE.jpg",
      "tags": [
        "music video",
        "mv",
        "twice"
      ]
    },
    {
      "id": "bb22bd920f3671b7",
      "title": "2026 Singapore K-Pop Tour Masterlist: Concerts, Fan Meetings, And More",
      "url": "https://www.soompi.com/article/1818452wpp/2026-singapore-k-pop-tour-masterlist-concerts-fan-meetings-and-more",
      "source": "Soompi",
      "publishedAt": "2026-02-11T02:21:05.000Z",
      "snippet": "Get ready, Singapore K-pop fans! 2026 is a big year for K-pop in Singapore with an exciting lineup of events including concerts, fan meetings, and fan-cons. This comprehensive mast...",
      "description": "Get ready, Singapore K-pop fans! 2026 is a big year for K-pop in Singapore with an exciting lineup of events including concerts, fan meetings, and fan-cons. This comprehensive masterlist is your ultimate guide to every K-pop tour visiting Singapore throughout 2026, ensuring you won’t miss a chance to see your favorite stars. Here are K-pop… Continue reading 2026 Singapore K-Pop Tour Masterlist: Concerts, Fan Meetings, And More The post 2026 Singapore K-Pop Tour Masterlist: Concerts, Fan Meetings, And More appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/10181849/472414997_1207080890775960_3956008932514841185_n.jpg",
      "tags": [
        "k-pop",
        "fan meeting"
      ]
    },
    {
      "id": "a748908ac41194b8",
      "title": "Cortis to return in April",
      "url": "https://www.koreaherald.com/article/10674321",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T01:21:31.000Z",
      "snippet": "Cortis will release a new album in April, said label Big Hit Music, confirming a local media report published Tuesday. The boy band's return comes about eight months after releasin...",
      "description": "Cortis will release a new album in April, said label Big Hit Music, confirming a local media report published Tuesday. The boy band's return comes about eight months after releasing its debut album “Color Outside the Lines.” The first EP sold more than 436,000 copies in the first week and had sold over 1.3 million copies as of December last year, the fourth-most and the second-most for a debut album from a K-pop boy group, respectively. The five-track set entered the Billboard 200 at No. 15 and",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260211.ca72b505c4d54cafb4cc532dc63c7df9_T1.jpg",
      "tags": [
        "k-pop",
        "debut",
        "album",
        "billboard"
      ]
    },
    {
      "id": "b22d665174348bb8",
      "title": "NMIXX To Become 1st K-Pop Artist To Perform At Brazil’s Carnival",
      "url": "https://www.soompi.com/article/1818645wpp/nmixx-to-become-1st-k-pop-artist-to-perform-at-brazils-carnival",
      "source": "Soompi",
      "publishedAt": "2026-02-10T23:46:06.000Z",
      "snippet": "NMIXX will be performing at Brazil’s Carnival next week! Brazilian singer Pabllo Vittar has announced that NMIXX will be a special guest at Bloco da Pabllo, a massive block party a...",
      "description": "NMIXX will be performing at Brazil’s Carnival next week! Brazilian singer Pabllo Vittar has announced that NMIXX will be a special guest at Bloco da Pabllo, a massive block party at the upcoming São Paulo Carnival, on February 16. NMIXX, who will be the first K-pop artist ever to perform at Carnival, will be joining… Continue reading NMIXX To Become 1st K-Pop Artist To Perform At Brazil’s Carnival The post NMIXX To Become 1st K-Pop Artist To Perform At Brazil’s Carnival appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/10154448/NMIXX.jpg",
      "tags": [
        "k-pop",
        "nmixx"
      ]
    },
    {
      "id": "cc40bc7e6d39022f",
      "title": "BTS, IZ*ONE, TWICE’s MISAMO, And aespa’s Karina Earn RIAJ Platinum And Gold Certifications For Streaming In Japan",
      "url": "https://www.soompi.com/article/1818633wpp/bts-izone-twices-misamo-and-aespas-karina-earn-riaj-platinum-and-gold-certifications-for-streaming-in-japan",
      "source": "Soompi",
      "publishedAt": "2026-02-10T22:41:20.000Z",
      "snippet": "The Recording Industry Association of Japan (RIAJ) has announced its latest batch of official certifications! In 2020, the RIAJ implemented a new certification system for online st...",
      "description": "The Recording Industry Association of Japan (RIAJ) has announced its latest batch of official certifications! In 2020, the RIAJ implemented a new certification system for online streaming of songs, as an addition to its pre-existing certification systems for physical album shipments and digital download sales. According to the new system, songs are certified silver once… Continue reading BTS, IZ*ONE, TWICE’s MISAMO, And aespa’s Karina Earn RIAJ Platinum And Gold Certifications For Streaming In Japan The post BTS, IZ*ONE, TWICE’s MISAMO, And aespa’s Karina Earn RIAJ Platinum And Gold Certificat...",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "album",
        "bts",
        "twice",
        "aespa"
      ]
    },
    {
      "id": "e9e436e071aecaf6",
      "title": "BIGHIT Confirms CORTIS Is Preparing For April Comeback",
      "url": "https://www.soompi.com/article/1818625wpp/bighit-confirms-cortis-is-preparing-for-april-comeback",
      "source": "Soompi",
      "publishedAt": "2026-02-10T19:10:05.000Z",
      "snippet": "CORTIS is gearing up to make the first comeback of their career in April! On February 10, BIGHIT MUSIC officially confirmed, “CORTIS is currently in the midst of preparing with the...",
      "description": "CORTIS is gearing up to make the first comeback of their career in April! On February 10, BIGHIT MUSIC officially confirmed, “CORTIS is currently in the midst of preparing with the goal of an April comeback.” CORTIS’s upcoming return will mark their first comeback following their official debut in August of last year, when they… Continue reading BIGHIT Confirms CORTIS Is Preparing For April Comeback The post BIGHIT Confirms CORTIS Is Preparing For April Comeback appeared first on Soompi.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "comeback",
        "debut"
      ]
    },
    {
      "id": "c8607d58d72f5366",
      "title": "ATEEZ’s “GOLDEN HOUR : Part.4” Becomes Their 5th Album To Sell 1 Million Copies In 1st Week",
      "url": "https://www.soompi.com/article/1818616wpp/ateezs-golden-hour-part-4-becomes-their-5th-album-to-sell-1-million-copies-in-1st-week",
      "source": "Soompi",
      "publishedAt": "2026-02-10T16:58:02.000Z",
      "snippet": "ATEEZ’s latest album is already a “million seller”! Last week, ATEEZ made their comeback with the new mini album “GOLDEN HOUR : Part.4” and its accompanying title track “Adrenaline...",
      "description": "ATEEZ’s latest album is already a “million seller”! Last week, ATEEZ made their comeback with the new mini album “GOLDEN HOUR : Part.4” and its accompanying title track “Adrenaline” on February 6. On February 10, Hanteo Chart announced that “GOLDEN HOUR : Part.4” had already sold over 1 million copies, making it ATEEZ’s fifth album… Continue reading ATEEZ’s “GOLDEN HOUR : Part.4” Becomes Their 5th Album To Sell 1 Million Copies In 1st Week The post ATEEZ’s “GOLDEN HOUR : Part.4” Becomes Their 5th Album To Sell 1 Million Copies In 1st Week appeared first on Soompi.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "comeback",
        "mini album",
        "album"
      ]
    },
    {
      "id": "8bac30e419e261b7",
      "title": "Update: IVE Reveals Track List For Upcoming Full-Length Album “REVIVE+”",
      "url": "https://www.soompi.com/article/1818582wpp/ive-reveals-comeback-schedule-for-new-album-revive-and-title-track-blackhole",
      "source": "Soompi",
      "publishedAt": "2026-02-10T14:33:57.000Z",
      "snippet": "Updated February 12 KST: IVE has released the track list for their upcoming full-length album “REVIVE+”! Original Article: IVE has revealed what fans can look forward to in the wee...",
      "description": "Updated February 12 KST: IVE has released the track list for their upcoming full-length album “REVIVE+”! Original Article: IVE has revealed what fans can look forward to in the weeks leading up to their comeback! On February 10, IVE released a detailed new schedule outlining the teasers they have in store for their upcoming full-length… Continue reading Update: IVE Reveals Track List For Upcoming Full-Length Album “REVIVE+” The post Update: IVE Reveals Track List For Upcoming Full-Length Album “REVIVE+” appeared first on Soompi.",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "comeback",
        "album",
        "ive"
      ]
    },
    {
      "id": "472e0d34b078a928",
      "title": "From rookies to global acts, K-pop increasingly turns to electronic music",
      "url": "https://www.koreaherald.com/article/10673810",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-10T06:51:50.000Z",
      "snippet": "An increasing number of K-pop acts are leaning into electronic music, signaling what could emerge as one of the genre’s defining sonic currents this year. From rookie groups such a...",
      "description": "An increasing number of K-pop acts are leaning into electronic music, signaling what could emerge as one of the genre’s defining sonic currents this year. From rookie groups such as KiiiKiii to established acts including Ive and Blackpink, artists are selecting house or electronic dance tracks as their lead singles. Even BTS is reported to have collaborated with American DJ and producer Diplo on its upcoming album “Arirang,” due March 20, further fueling expectations around an EDM-driven directi",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260210.38c1b823e5e042bc8da2370b417090c9_T1.jpg",
      "tags": [
        "k-pop",
        "album",
        "bts",
        "blackpink",
        "ive"
      ]
    },
    {
      "id": "777159c9edc5f7c1",
      "title": "Le Sserafim tops Oricon singles chart",
      "url": "https://www.koreaherald.com/article/10673569",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-10T02:45:00.000Z",
      "snippet": "Le Sserafim claimed the No. 1 spot on Oricon’s Weekly Single Ranking with “Spaghetti,” according to the chart published Tuesday. This is the first time in three years an internatio...",
      "description": "Le Sserafim claimed the No. 1 spot on Oricon’s Weekly Single Ranking with “Spaghetti,” according to the chart published Tuesday. This is the first time in three years an international female act sat atop the chart. The five-member group nabbed the highest rung on the chart three months after the album release, notching the spot it landed in 2023 with its Japan debut single “Fearless.” The chart success owes to the quintet’s first international tour, “Easy Crazy Hot,” which saw it play the Tokyo",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/10/news-p.v1.20260210.a4021eea0dd9494d9793031cfbb0c21c_T1.jpg",
      "tags": [
        "debut",
        "album",
        "le sserafim"
      ]
    },
    {
      "id": "829e6c2e4c6fb6a7",
      "title": "Seventeen’s DK, Seungkwan certified gold in Japan",
      "url": "https://www.koreaherald.com/article/10673407",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-10T01:55:55.000Z",
      "snippet": "DK and Seungkwan of Seventeen certified gold in Japan with their first EP “Serenade,” agency Pledis Entertainment announced Tuesday, citing the Recording Industry Association of Ja...",
      "description": "DK and Seungkwan of Seventeen certified gold in Japan with their first EP “Serenade,” agency Pledis Entertainment announced Tuesday, citing the Recording Industry Association of Japan. The mini album logged more than 100,000 shipments, making the duo Seventeen's third subunit to earn gold certification, following Junghan and Wonwoo, and S.Coups and Mingyu. As a full group, Seventeen has achieved the feat with 18 of its albums. The EP landed atop Oricon’s Daily Album Ranking and remains at No. 1",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/10/news-p.v1.20260210.0d3a56152137437e8468bd2efe829e57_T1.jpg",
      "tags": [
        "mini album",
        "album",
        "seventeen"
      ]
    },
    {
      "id": "f11e3ef27512e819",
      "title": "Stray Kids to celebrate 8 years together with fans",
      "url": "https://www.koreaherald.com/article/10673381",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-10T01:38:13.000Z",
      "snippet": "Stray Kids will meet and greet fans in person through four days of fan meetings, JYP Entertainment announced Monday. The eight bandmates will celebrate the eighth anniversary of th...",
      "description": "Stray Kids will meet and greet fans in person through four days of fan meetings, JYP Entertainment announced Monday. The eight bandmates will celebrate the eighth anniversary of their debut with the event, titled “Stay in Our Little House,” at Incheon Inspire Arena. \"Stay\" is the group’s official fandom community. The fan meetups will be held on March 28-29 and April 4-5. The second and fourth events will be broadcast online. Separately, the group's tour film “Stray Kids: The Dominate Experience",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/10/news-p.v1.20260210.85ee71fcd38746a4817af3fa99d6ac83_T1.jpg",
      "tags": [
        "debut",
        "fan meeting",
        "stray kids"
      ]
    },
    {
      "id": "82b807507a0605e8",
      "title": "BTS’ comeback reshapes Hybe&apos;s release calendar",
      "url": "https://www.koreaherald.com/article/10672824",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-09T06:10:10.000Z",
      "snippet": "As BTS prepares to release its highly anticipated new album “Arirang” on March 20, other K-pop acts planning comebacks around the same period are recalibrating their schedules to n...",
      "description": "As BTS prepares to release its highly anticipated new album “Arirang” on March 20, other K-pop acts planning comebacks around the same period are recalibrating their schedules to navigate the ripple effects of the group’s return. Within Hybe, which houses BTS’ agency Big Hit Music, affiliated labels are moving in strategic alignment with the comeback. Rather than avoiding the period altogether, some groups are timing their releases to benefit from heightened attention on K-pop as a whole — a so-",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260209.b30942423aa044acbef8ba696729bdd8_T1.jpg",
      "tags": [
        "k-pop",
        "comeback",
        "album",
        "bts"
      ]
    },
    {
      "id": "690a295d05372751",
      "title": "Army, get ready: BTS Gwanghwamun comeback show tickets drop Feb. 23",
      "url": "https://www.koreaherald.com/article/10672661",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-09T04:05:23.000Z",
      "snippet": "BTS unveiled ticketing details for their highly anticipated comeback performance at Gwanghwamun Square in central Seoul — the group’s first live appearance in more than three years...",
      "description": "BTS unveiled ticketing details for their highly anticipated comeback performance at Gwanghwamun Square in central Seoul — the group’s first live appearance in more than three years. On Monday, Big Hit Music announced through global fan platform Weverse that BTS The Comeback Live: Arirang will take place at 8 p.m. on March 21. The seven-member group will perform fan-favorites as well as new songs from their upcoming fifth album, “Arirang,” which will be released a day earlier on March 20. The con",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/09/news-p.v1.20260209.9a46a6b0d30b46839b6f6b7ba7be22c7_T1.jpg",
      "tags": [
        "comeback",
        "album",
        "bts"
      ]
    },
    {
      "id": "1125941dc1cf184a",
      "title": "H1-Key to bring out 5th EP next month",
      "url": "https://www.koreaherald.com/article/10672537",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-09T02:15:19.000Z",
      "snippet": "Girl group H1-Key will release its fifth mini album, \"Love Chapter,\" on March 5, Choi Creative Lab announced Monday. The upcoming EP will be its first new release in about nine mon...",
      "description": "Girl group H1-Key will release its fifth mini album, \"Love Chapter,\" on March 5, Choi Creative Lab announced Monday. The upcoming EP will be its first new release in about nine months, coming on the heels of the previous EP \"Lovestruck.\" The last release might have been slow in terms of album sales, but focus track \"Summer Was You\" made a series of best songs lists, ranking No. 6 on NME's \"The 25 Best K-pop Songs of 2025\" and No. 10 on Billboard's ranking. \"Coupled with a soaring and infectious",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/09/news-p.v1.20260209.527392cebd684e84b58aba40e0f5277d_T1.jpg",
      "tags": [
        "k-pop",
        "mini album",
        "album",
        "billboard"
      ]
    },
    {
      "id": "d82379de63ce77fe",
      "title": "Blackpink&apos;s Jisoo hits 100m views on &apos;Earthquake&apos; video",
      "url": "https://www.koreaherald.com/article/10672496",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-09T01:59:55.000Z",
      "snippet": "Jisoo of Blackpink reached the milestone of 100 million views on YouTube with the music video for \"Earthquake\" as of Saturday, according to her agency Blissoo. The video for the fo...",
      "description": "Jisoo of Blackpink reached the milestone of 100 million views on YouTube with the music video for \"Earthquake\" as of Saturday, according to her agency Blissoo. The video for the focus track from her first solo EP, \"Amortage,\" was released in February last year. The single ranked No. 47 on the Billboard Global 200 chart and No. 22 on the Global 200 Excl. US chart. It topped Billboard's World Digital Song Sales Chart. The four-track set debuted atop iTunes albums charts in 45 regions and sold more",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/09/news-p.v1.20260209.560eef7587234fecab37cd3bbab4122e_T1.jpg",
      "tags": [
        "music video",
        "billboard",
        "blackpink"
      ]
    },
    {
      "id": "d6f0abee028d64fb",
      "title": "BTS achieves highest single-show capacity at Tottenham Hotspur Stadium",
      "url": "https://www.koreaherald.com/article/10672047",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-08T06:20:00.000Z",
      "snippet": "BTS is set to achieve another milestone at the Tottenham Hotspur Stadium in London, with the highest-ever audience capacity for a single concert at the venue, according to Live Nat...",
      "description": "BTS is set to achieve another milestone at the Tottenham Hotspur Stadium in London, with the highest-ever audience capacity for a single concert at the venue, according to Live Nation UK. Via its social media channels, the British concert promoter announced that BTS’ fandom, Army, would “create highest single show capacity” to date for the group’s upcoming concert at the venue. BTS is scheduled to hold two shows at Tottenham Hotspur Stadium on July 6 and 7, with an estimated 120,000 fans attendi",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/08/news-p.v1.20260208.51837ba74fb34eab83af00fbe05225fb_T1.jpg",
      "tags": [
        "concert",
        "bts"
      ]
    },
    {
      "id": "adb33fd5d914148f",
      "title": "Blackpink, Ive to face off for chart success in late February",
      "url": "https://www.koreaherald.com/article/10672006",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-08T04:15:44.000Z",
      "snippet": "A grand face-off in K-pop is on the horizon, as two of the industry’s most prominent girl groups — Blackpink and Ive — are gearing up for back-to-back releases late this month. Wit...",
      "description": "A grand face-off in K-pop is on the horizon, as two of the industry’s most prominent girl groups — Blackpink and Ive — are gearing up for back-to-back releases late this month. With only four days separating the two groups’ respective returns, K-pop fans are anticipating a head-to-head battle on the charts, pitting one of the most globally recognized acts against a leading fourth-generation girl group, each of them known for consistently putting out hits. On Feb. 27, Blackpink will release its t",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/08/news-p.v1.20260208.03b256622e6647af8cc0f5ad05657179_T1.jpg",
      "tags": [
        "k-pop",
        "blackpink",
        "ive"
      ]
    },
    {
      "id": "58877928ba54ffd9",
      "title": "BTS to turn Seoul into cultural stage with ‘The City Seoul’",
      "url": "https://www.koreaherald.com/article/10671570",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T08:58:18.000Z",
      "snippet": "BTS will be extending its comeback celebrations beyond the stage and into Seoul itself as it transforms the city into a massive, immersive cultural venue this spring. “BTS The City...",
      "description": "BTS will be extending its comeback celebrations beyond the stage and into Seoul itself as it transforms the city into a massive, immersive cultural venue this spring. “BTS The City Arirang Seoul,” launching March 20 and running through April 12, is a citywide project marking the release of BTS' fifth album “Arirang,” agency Big Hit Music announced Thursday. The event will also follow the group's comeback show, “BTS Comeback Live: Arirang,” set for Gwanghwamun Square in central Seoul. “In collabo",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.d925ef6a4e274eb5a3a815bf17920244_T1.jpg",
      "tags": [
        "comeback",
        "album",
        "bts"
      ]
    },
    {
      "id": "7e0e36b3f30ef908",
      "title": "Blackpink unveils tracklist for new EP, with ‘Go’ as main track",
      "url": "https://www.koreaherald.com/article/10671525",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T07:47:05.000Z",
      "snippet": "Blackpink has revealed the tracklist for its upcoming third EP “Deadline,” marking the group’s first full-member release in approximately three years and five months. According to...",
      "description": "Blackpink has revealed the tracklist for its upcoming third EP “Deadline,” marking the group’s first full-member release in approximately three years and five months. According to YG Entertainment on Friday, the new album will feature five tracks: pre-release single “Jump,” main track “Go,” as well as B-side tracks “Me and My,” “Champion” and “Fxxxboy.” YG describes the album as a snapshot of the girl group at its peak. “As the title ‘Deadline’ suggests, the album will be filled with Blackpink’s",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.48bdab8d2b56437ebd6a0774a9d1fe3d_T1.jpg",
      "tags": [
        "album",
        "blackpink"
      ]
    },
    {
      "id": "35a8de7b70c4c89d",
      "title": "Hearts2Hearts to drop new single",
      "url": "https://www.koreaherald.com/article/10671169",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T02:05:32.000Z",
      "snippet": "Rookie girl group Hearts2Hearts is poised to release a single, label SM Entertainment said Friday. The group will drop “Rude!” on Feb. 20, about four months after its first EP, “Fo...",
      "description": "Rookie girl group Hearts2Hearts is poised to release a single, label SM Entertainment said Friday. The group will drop “Rude!” on Feb. 20, about four months after its first EP, “Focus.” It debuted in February 2025 with “The Chase” and added the digital single “Style” in June, followed by a mini album in October. The group took home seven rookie awards by the end of the year and was a candidate for best new artist (K-pop) at the 2026 iHeartRadio Music Awards. On Feb. 21-22, the eight members will",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.976c9b841f9a4797bedc2de042e8e592_T1.jpg",
      "tags": [
        "k-pop",
        "mini album",
        "album"
      ]
    },
    {
      "id": "e92e22d9ab2edc96",
      "title": "Ive announces March fan concert",
      "url": "https://www.koreaherald.com/article/10671103",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-06T01:23:02.000Z",
      "snippet": "Ive will hold its fourth fan concert March 21-22 in Incheon, its agency Starship Entertainment announced Thursday. The second day’s event will be broadcast online to reach more fan...",
      "description": "Ive will hold its fourth fan concert March 21-22 in Incheon, its agency Starship Entertainment announced Thursday. The second day’s event will be broadcast online to reach more fans. The group of six named the two-date event “Ive into Dive,” emphasizing its connection with fans. Dive is the name of its official fandom community. At the fan concert, Ive is expected to perform new songs from its second studio album “Revive+” which is due out on Feb. 23. On Monday, the group will drop the B-side tr",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/06/news-p.v1.20260206.6bdcc8bed9fe4aebbc26ec7676fb0d56_T1.jpg",
      "tags": [
        "album",
        "concert",
        "ive"
      ]
    },
    {
      "id": "640856f8966dde7a",
      "title": "The ‘BTS effect’ becomes reality in Seoul",
      "url": "https://www.koreaherald.com/article/10669622",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T05:59:40.000Z",
      "snippet": "With a little more than a month left until BTS’ historic return to the stage, Seoul is already feeling the heat. The group’s concert on March 21 at Gwanghwamun Square — their first...",
      "description": "With a little more than a month left until BTS’ historic return to the stage, Seoul is already feeling the heat. The group’s concert on March 21 at Gwanghwamun Square — their first full-group performance in over three years — has sent ripple effects through Seoul’s hospitality, retail and aviation industries, with nearby luxury hotels booked out and even budget motels hiking rates to nearly 500,000 won ($344) a night. Hotel industry data and tourism platforms show that the “BTS effect” is alread",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.d85707d318624b7ab7aa74d5084b44de_T1.jpg",
      "tags": [
        "concert",
        "bts"
      ]
    },
    {
      "id": "af242ab72befb734",
      "title": "Le Sserafim’s encore Seoul show — tightly choreographed to the last beat",
      "url": "https://www.koreaherald.com/article/10669577",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T05:18:14.000Z",
      "snippet": "Le Sserafim wrapped up its first world tour, “Easy Crazy Hot,” with a sold-out encore concert in Seoul on Sunday, closing a run that spanned 31 shows across 20 cities. Held at Jams...",
      "description": "Le Sserafim wrapped up its first world tour, “Easy Crazy Hot,” with a sold-out encore concert in Seoul on Sunday, closing a run that spanned 31 shows across 20 cities. Held at Jamsil Indoor Stadium, the final performance drew a near-capacity crowd, excluding limited-view seats. The tour, which began in Incheon in April last year, marked nearly a full year on the road for the group. Despite the demanding schedule, the members powered through a three-hour set featuring 26 songs, including original",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260203.d793e408b7b84e6b9d2b03104d563b72_T1.jpg",
      "tags": [
        "world tour",
        "concert",
        "le sserafim"
      ]
    },
    {
      "id": "82ef66d494a2bfa1",
      "title": "BTS logs 3m presaves on Spotify",
      "url": "https://www.koreaherald.com/article/10669476",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-04T03:21:29.000Z",
      "snippet": "The soon-to-be-released album from BTS amassed 3 million presaves on Spotify as of Wednesday. Its fifth full album “Arirang” has remained atop the platform's Countdown Chart Global...",
      "description": "The soon-to-be-released album from BTS amassed 3 million presaves on Spotify as of Wednesday. Its fifth full album “Arirang” has remained atop the platform's Countdown Chart Global for two weeks. The album will be available on March 20, a much-hyped return of the septet as a full group after more than 3 1/2 years away from the music scene. Fans have been listening to its old songs on repeat, pushing a number of them past milestones. “Yet To Come” from anthology album “Proof” and “Love Maze” from",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/04/news-p.v1.20260204.9940a1d4b7a94a6083052dd62f30fb80_T1.jpg",
      "tags": [
        "album",
        "bts"
      ]
    }
  ]
}