{
  "generatedAt": "2026-02-22T13:55:07.962Z",
  "items": [
    {
      "id": "99f7de20f2ef9c5c",
      "title": "Popular K-Pop Idol Group Embroiled In Recent Male Singer Wedlock Controversy",
      "url": "https://www.koreaboo.com/news/highlight-embroiled-in-kpop-male-singer-child-wedlock-controversy/",
      "source": "Koreaboo",
      "publishedAt": "2026-02-22T06:01:24.000Z",
      "snippet": "They will take legal action.",
      "description": "They will take legal action.",
      "image": "https://image.koreaboo.com/2026/02/post4-2026-02-22T145644.213.jpg",
      "tags": [
        "k-pop",
        "idol"
      ]
    },
    {
      "id": "08cd83690881fa4d",
      "title": "K-Pop Artists Sweep 7 Of Top 10 Spots On IFPI’s Global Album Sales Chart For 2025",
      "url": "https://www.soompi.com/article/1820592wpp/k-pop-artists-sweep-7-of-top-10-spots-on-ifpis-global-album-sales-chart-for-2025",
      "source": "Soompi",
      "publishedAt": "2026-02-22T03:57:54.000Z",
      "snippet": "K-pop made an exceptionally strong showing on the IFPI’s year-end Global Album Sales Chart for 2025! The International Federation of the Phonographic Industry (IFPI)—a non-profit o...",
      "description": "K-pop made an exceptionally strong showing on the IFPI’s year-end Global Album Sales Chart for 2025! The International Federation of the Phonographic Industry (IFPI)—a non-profit organization that represents the music recording industry worldwide—has revealed its annual ranking of last year’s best-selling albums across global physical sales and digital downloads. Stray Kids’ “KARMA” took No. 2… Continue reading K-Pop Artists Sweep 7 Of Top 10 Spots On IFPI’s Global Album Sales Chart For 2025 The post K-Pop Artists Sweep 7 Of Top 10 Spots On IFPI’s Global Album Sales Chart For 2025 appeared fir...",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/21195348/Stray-Kids-SEVENTEEN-ENHYPEN-TXT-ZEROBASEONE-IVE.jpg",
      "tags": [
        "k-pop",
        "album",
        "stray kids"
      ]
    },
    {
      "id": "a21c6b89c0cd7f36",
      "title": "TWICE’s “Dance The Night Away” Becomes Their 12th Group MV To Hit 400 Million Views",
      "url": "https://www.soompi.com/article/1820475wpp/twices-dance-the-night-away-becomes-their-12th-group-mv-to-hit-400-million-views",
      "source": "Soompi",
      "publishedAt": "2026-02-21T03:01:06.000Z",
      "snippet": "TWICE has hit the 400 million mark with yet another music video! On February 21 at around 8 a.m. KST, TWICE’s music video for their 2018 summer hit “Dance The Night Away” surpassed...",
      "description": "TWICE has hit the 400 million mark with yet another music video! On February 21 at around 8 a.m. KST, TWICE’s music video for their 2018 summer hit “Dance The Night Away” surpassed 400 million views on YouTube, making it their 12th music video to do so following “TT,” “LIKEY,” “What Is Love?“, “Cheer Up,”… Continue reading TWICE’s “Dance The Night Away” Becomes Their 12th Group MV To Hit 400 Million Views The post TWICE’s “Dance The Night Away” Becomes Their 12th Group MV To Hit 400 Million Views appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/20185619/TWICE_0dcc71.jpg",
      "tags": [
        "music video",
        "mv",
        "twice"
      ]
    },
    {
      "id": "7e1f3e13797d62dc",
      "title": "7 Idol Romance K-Dramas To Watch If You’re A K-Pop Fan",
      "url": "https://www.soompi.com/article/1819517wpp/7-idol-romance-k-dramas-to-watch-if-youre-a-k-pop-fan",
      "source": "Soompi",
      "publishedAt": "2026-02-21T01:36:49.000Z",
      "snippet": "Imagine falling in love with your favorite star not on screen but in the quiet ordinariness of everyday life. While K-dramas have often flirted with celebrity love stories, idol ro...",
      "description": "Imagine falling in love with your favorite star not on screen but in the quiet ordinariness of everyday life. While K-dramas have often flirted with celebrity love stories, idol romances exist in a far more emotionally charged space. Idols are not just famous; they are curated, surveilled, and emotionally connected to fandoms. In “idol x… Continue reading 7 Idol Romance K-Dramas To Watch If You’re A K-Pop Fan The post 7 Idol Romance K-Dramas To Watch If You’re A K-Pop Fan appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/15035508/Idol-I-lovely-runner.png",
      "tags": [
        "k-pop",
        "idol"
      ]
    },
    {
      "id": "27ff7276884d3cde",
      "title": "Update on BTS comeback show in Seoul: Ticketed entry, one-hour show; city preparing for 260,000 fans",
      "url": "https://www.koreaherald.com/article/10679359",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-20T11:48:54.000Z",
      "snippet": "An update on BTS’ upcoming show “BTS The Comeback Live: Arirang” in central Seoul next month: Access to designated viewing areas for the concert will be limited to fans with advanc...",
      "description": "An update on BTS’ upcoming show “BTS The Comeback Live: Arirang” in central Seoul next month: Access to designated viewing areas for the concert will be limited to fans with advance tickets, organizers said, and the show will run for about one hour. Seoul police are preparing extensive crowd control measures amid expectations that attendance could reach 260,000. According to an announcement posted Friday on the global fan platform Weverse, entry to the main viewing zones for the one-hour event —",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/20/news-p.v1.20260220.f5361b66417d43e8a387999f9e376cd5_T1.jpg",
      "tags": [
        "comeback",
        "concert",
        "bts"
      ]
    },
    {
      "id": "0c31164887fc8526",
      "title": "ATEEZ Takes 5th Win For “Adrenaline” On “Music Bank”",
      "url": "https://www.soompi.com/article/1820423wpp/ateez-takes-5th-win-for-adrenaline-on-music-bank",
      "source": "Soompi",
      "publishedAt": "2026-02-20T11:27:08.000Z",
      "snippet": "ATEEZ has taken their fifth win for “Adrenaline”! KBS 2TV’s “Music Bank” did not air a new episode on February 20, but the music show still announced this week’s winner on its offi...",
      "description": "ATEEZ has taken their fifth win for “Adrenaline”! KBS 2TV’s “Music Bank” did not air a new episode on February 20, but the music show still announced this week’s winner on its official website. ATEEZ took the win with a total of 10,307 points on the Music Bank K-Chart from February 9 to 15. IVE‘s “BANG… Continue reading ATEEZ Takes 5th Win For “Adrenaline” On “Music Bank” The post ATEEZ Takes 5th Win For “Adrenaline” On “Music Bank” appeared first on Soompi.",
      "image": "https://0.soompi.io/wp-content/uploads/2026/02/20033643/ateez-kbs-1.jpg",
      "tags": [
        "music bank",
        "ive"
      ]
    },
    {
      "id": "5f95ca4b456c5f8a",
      "title": "Two former Oh My Girl members are taking on the big screen. How&apos;s that going?",
      "url": "https://www.koreaherald.com/article/10679349",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-20T11:23:59.000Z",
      "snippet": "The mid-to-late 2010s saw no shortage of K-pop girl groups — the so-called \"third generation\" of idol acts that gave us Blackpink, Twice, Red Velvet and dozens more. Oh My Girl wer...",
      "description": "The mid-to-late 2010s saw no shortage of K-pop girl groups — the so-called \"third generation\" of idol acts that gave us Blackpink, Twice, Red Velvet and dozens more. Oh My Girl were never quite the frontrunners, but they did make their presence felt. Coming out of the smaller-label WM Entertainment, the group built a loyal fanbase on dreamy, experimental concepts and some genuinely inventive tracks. They also became one of the industry's unlikelier success stories, breaking through commercially",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/20/news-p.v1.20260220.9146041c3f0341d7ab2540c21d1852bd_T1.jpg",
      "tags": [
        "k-pop",
        "idol",
        "blackpink",
        "twice",
        "red velvet"
      ]
    },
    {
      "id": "bf355153e4f87517",
      "title": "Stray Kids hit 300m views with ‘S-Class’ music video",
      "url": "https://www.koreaherald.com/article/10679034",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-20T02:22:55.000Z",
      "snippet": "Stray Kids exceeded 300 million hits on YouTube with the music video for “S-Class” as of Thursday, according to label JYP Entertainment. It is the band’s sixth music video to accom...",
      "description": "Stray Kids exceeded 300 million hits on YouTube with the music video for “S-Class” as of Thursday, according to label JYP Entertainment. It is the band’s sixth music video to accomplish the feat, after those of “God’s Menu,” “Back Door,” “Thunderous,” “Maniac” and “Lalalala.” Co-written by Bang Chan, Changbin and Han, “S-Class” is the eight-piece act’s hit from 2023 and the focus track from third studio album “5-Star.” The LP sold over 4.6 million copies in the first week, the most in K-pop hist",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/20/news-p.v1.20260220.5fc54bb1d1784131923d5394a2539526_T1.jpg",
      "tags": [
        "k-pop",
        "album",
        "music video",
        "stray kids"
      ]
    },
    {
      "id": "da458f7ce4134e6f",
      "title": "BLACKPINK’s Rosé And HUNTR/X Take No. 1 And No. 2 On IFPI’s Global Single Chart For 2025",
      "url": "https://www.soompi.com/article/1820260wpp/blackpinks-rose-and-huntr-x-take-no-1-and-no-2-on-ifpis-global-single-chart-for-2025",
      "source": "Soompi",
      "publishedAt": "2026-02-19T23:06:49.000Z",
      "snippet": "BLACKPINK’s Rosé and “KPop Demon Hunters” girl group HUNTR/X topped the IFPI’s year-end Global Single Chart for 2025! On February 19 local time, the International Federation of the...",
      "description": "BLACKPINK’s Rosé and “KPop Demon Hunters” girl group HUNTR/X topped the IFPI’s year-end Global Single Chart for 2025! On February 19 local time, the International Federation of the Phonographic Industry (IFPI)—a non-profit organization that represents the music recording industry worldwide—revealed its annual ranking of last year’s best-selling singles. Rosé and Bruno Mars’ hit collab “APT.”… Continue reading BLACKPINK’s Rosé And HUNTR/X Take No. 1 And No. 2 On IFPI’s Global Single Chart For 2025 The post BLACKPINK’s Rosé And HUNTR/X Take No. 1 And No. 2 On IFPI’s Global Single Chart For 2025...",
      "image": "/public/placeholder-news.svg",
      "tags": [
        "kpop",
        "blackpink"
      ]
    },
    {
      "id": "47d239745c3b5b04",
      "title": "G-Dragon’s Middle East debut marred by chaotic planning at Dubai show",
      "url": "https://www.koreaherald.com/article/10678680",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-19T11:17:36.000Z",
      "snippet": "G-Dragon’s first official performance in the Middle East ended in disappointment Tuesday, with the “Krazy Super Concert” in Dubai overshadowed by what attendees and industry inside...",
      "description": "G-Dragon’s first official performance in the Middle East ended in disappointment Tuesday, with the “Krazy Super Concert” in Dubai overshadowed by what attendees and industry insiders described as inexperienced event management. The concert, held at Dubai Media City Amphitheater in the United Arab Emirates on Tuesday, marked a symbolic milestone for the K-pop icon. But hasty promotion and questionable planning by organizer Pu1se Events diluted the show's significance, critics say. A local promote",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/19/news-p.v1.20260219.a016541f58194888a266874f9d8c3ee6_T1.jpg",
      "tags": [
        "k-pop",
        "debut",
        "concert"
      ]
    },
    {
      "id": "3c31dfa1321be6b6",
      "title": "Stray Kids rank No. 2 on global artist chart",
      "url": "https://www.koreaherald.com/article/10678272",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-19T02:22:58.000Z",
      "snippet": "Stray Kids ranked No. 2 on the International Federation of the Phonographic Industry's Global Artist Chart, according to the organization on Thursday. Marking the group's fourth co...",
      "description": "Stray Kids ranked No. 2 on the International Federation of the Phonographic Industry's Global Artist Chart, according to the organization on Thursday. Marking the group's fourth consecutive year on the chart since its debut at No. 7, it is the only K-pop artist to rank among the top ten this year. It claimed the highest rung so far, following Taylor Swift. The group is slated to host a fan meetup in Korea next month. Under the title “Stay in Our Little House,” Stray Kids hold four shows at Inche",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/19/news-p.v1.20260219.81280655c73c499a845e577a65810d87_T1.jpg",
      "tags": [
        "k-pop",
        "debut",
        "stray kids"
      ]
    },
    {
      "id": "ba7e4aeac7fc95aa",
      "title": "Cortis logs 100m Spotify streams this year alone",
      "url": "https://www.koreaherald.com/article/10678244",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-19T02:17:57.000Z",
      "snippet": "Cortis hit 100 million streams on Spotify for 2026, according to Big Hit Music on Thursday. The rookie boy band achieved the feat in just 45 days with seven tracks — six from its d...",
      "description": "Cortis hit 100 million streams on Spotify for 2026, according to Big Hit Music on Thursday. The rookie boy band achieved the feat in just 45 days with seven tracks — six from its debut album “Color Outside the Lines” along with “Mention Me,” which it sang for the soundtrack of animation “GOAT.” The group's first album has maintained a spot on Billboard’s World Albums Chart for 23 weeks straight, after debuting on the Billboard 200 at No. 15. Last week, the five-member act performed for the NBA C",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/19/news-p.v1.20260219.7591d1230f4241eba6d58ff0772c7c25_T1.jpg",
      "tags": [
        "debut",
        "album",
        "billboard"
      ]
    },
    {
      "id": "7dd7e2eda39a2cd4",
      "title": "Ateez lands on Billboard 200 at No. 3",
      "url": "https://www.koreaherald.com/article/10678165",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-19T01:32:05.000Z",
      "snippet": "Ateez placed its 13th mini album at No. 3 on Billboard 200 dated Feb. 21. The EP “Golden Hour: Part 4” is its sixth consecutive album to hit the main albums chart within the top th...",
      "description": "Ateez placed its 13th mini album at No. 3 on Billboard 200 dated Feb. 21. The EP “Golden Hour: Part 4” is its sixth consecutive album to hit the main albums chart within the top three, and eighth overall to sit among the top ten. The five-track set rolled out Feb. 8 and topped the iTunes Top Albums Chart in 31 regions, and the main track, “Adrenaline,” debuted atop the Top Songs Chart in 18. The mini album sold more than 1.5 million copies in its first week and became the group’s sixth straight",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/19/news-p.v1.20260219.e85fddeab363411d95aa9a4455693908_T1.jpg",
      "tags": [
        "mini album",
        "album",
        "billboard"
      ]
    },
    {
      "id": "40d9481cf8615cc5",
      "title": "J-Hope donates W300m to kids&apos; hospital, charity for his birthday",
      "url": "https://www.koreaherald.com/article/10677699",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-18T01:45:35.000Z",
      "snippet": "J-Hope of BTS has donated 200 million won ($138,000) to the children’s hospital at Seoul Asan Hospital to mark his birthday, the hospital said Wednesday. The K-pop star was born on...",
      "description": "J-Hope of BTS has donated 200 million won ($138,000) to the children’s hospital at Seoul Asan Hospital to mark his birthday, the hospital said Wednesday. The K-pop star was born on Feb. 18, 1994. “I continue to donate as a way to give back to Army, who always give me so much support,” J-Hope said. “I’m grateful to make another meaningful contribution on my birthday this year, just as I did last year. I sincerely hope children can overcome their pain and dream bright dreams.” The BTS member also",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/18/news-p.v1.20250820.c3c23740036a49458b2e06630cd8084e_T1.jpg",
      "tags": [
        "k-pop",
        "bts"
      ]
    },
    {
      "id": "2db4e031ca845c19",
      "title": "BTS graces GQ magazine cover in 15 markets ahead of new album release",
      "url": "https://www.koreaherald.com/article/10676892",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-14T01:48:48.000Z",
      "snippet": "K-pop group BTS has graced the cover of GQ magazine's latest edition in 15 international markets ahead of the release of its fifth full-length album next month, its agency said Sat...",
      "description": "K-pop group BTS has graced the cover of GQ magazine's latest edition in 15 international markets ahead of the release of its fifth full-length album next month, its agency said Saturday. According to BigHit Music, BTS has been selected as the cover model for the March issue of the men's fashion magazine in 15 countries and regions, including South Korea, the United States, Britain, Japan, Mexico, Germany and Thailand. The agency said it marked the first time a Korean artist has simultaneously ap",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/14/news-a.v1.20260214.bc634c069bb1462298cd99b118ae472d_T1.png",
      "tags": [
        "k-pop",
        "album",
        "bts"
      ]
    },
    {
      "id": "b5767ae54021cc5f",
      "title": "Twice tops 100m views with ‘This Is For’ music video",
      "url": "https://www.koreaherald.com/article/10676445",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-13T02:31:45.000Z",
      "snippet": "Twice reached 100 million views on YouTube with the music video for “This Is For,” according to label JYP Entertainment on Friday. The group now has 26 videos with over 100 million...",
      "description": "Twice reached 100 million views on YouTube with the music video for “This Is For,” according to label JYP Entertainment on Friday. The group now has 26 videos with over 100 million views, extending its record as the female group with the most music videos at that level worldwide. “This Is For” is the main track from the eponymous fourth studio album, released in July last year. The LP entered Billboard 200 at No. 6, becoming the nine-member group’s seventh consecutive album to reach the top 10 o",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/13/news-p.v1.20260213.ef8bd6fbecf14352a56c35c28d62d314_T1.jpg",
      "tags": [
        "album",
        "music video",
        "billboard",
        "twice"
      ]
    },
    {
      "id": "aaa7722cd3b7273e",
      "title": "Riize to livestream Seoul show in cinemas",
      "url": "https://www.koreaherald.com/article/10676427",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-13T02:26:39.000Z",
      "snippet": "The final concert of Riize’s first international tour will be available for viewing in cinemas, label SM Entertainment said Friday. The six-member act is set to go live in Seoul on...",
      "description": "The final concert of Riize’s first international tour will be available for viewing in cinemas, label SM Entertainment said Friday. The six-member act is set to go live in Seoul on March 6-8, concluding the tour “Riizing Loud,” and the second night of the sold-out run will be livestreamed in 32 theaters nationwide. The three-night run will wrap up the tour that began in Seoul last year and took the bandmates to 21 cities around the world. On Feb. 21-23, the group will give an encore show in Japa",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/13/news-p.v1.20260213.ae2c45b9b56b422594137e0d4de8701b_T1.jpg",
      "tags": [
        "concert",
        "riize"
      ]
    },
    {
      "id": "b8bc4a19d1bb0e86",
      "title": "Alpha Drive One hits high on Oricon chart",
      "url": "https://www.koreaherald.com/article/10676278",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-13T01:30:24.000Z",
      "snippet": "Boy band Alpha Drive One ranked No. 4 on Oricon’s Monthly Album Ranking with its debut album “Euphoria,” according to agency WakeOne Entertainment on Friday. It debuted on Oricon’s...",
      "description": "Boy band Alpha Drive One ranked No. 4 on Oricon’s Monthly Album Ranking with its debut album “Euphoria,” according to agency WakeOne Entertainment on Friday. It debuted on Oricon’s Weekly and Weekly Combined Album Rankings at No. 3, and spent another week on both at No. 4. The first EP from the rookie group was unveiled in January and sold more than 1.44 million units in a week, setting a record as the second-best-selling debut album from a K-pop group, while all six tracks from the album made M",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/13/news-p.v1.20260213.560e941877064f41ad800f5ece4c290b_T1.jpg",
      "tags": [
        "k-pop",
        "debut",
        "album"
      ]
    },
    {
      "id": "8ecdb44d93faf56b",
      "title": "BTS to stream new world tour shows in cinemas worldwide",
      "url": "https://www.koreaherald.com/article/10676096",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-12T23:54:34.000Z",
      "snippet": "K-pop giant BTS will livestream the opening shows of its new world tour \"Arirang\" in cinemas across South Korea and around the world, its agency BigHit Music said Friday. The scree...",
      "description": "K-pop giant BTS will livestream the opening shows of its new world tour \"Arirang\" in cinemas across South Korea and around the world, its agency BigHit Music said Friday. The screenings will feature the band's concerts in Goyang, just northwest of Seoul, on April 11 and in Tokyo on April 18 at more than 3,500 theaters in 75 countries. Some regions will show delayed broadcasts due to time differences, the company said. In South Korea, leading multiplex chains CGV, Lotte Cinema and Megabox will ho",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/13/rcv.YNA.20260122.PYH2026012207610001300_T1.jpg",
      "tags": [
        "k-pop",
        "world tour",
        "bts"
      ]
    },
    {
      "id": "5ab433246126c485",
      "title": "National Museum of Korea goes pink for Blackpink&apos;s comeback",
      "url": "https://www.koreaherald.com/article/10675708",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-12T06:02:57.000Z",
      "snippet": "Blackpink is expanding beyond music into cultural heritage to mark the Feb. 27 release of its third EP “Deadline,” becoming the first K-pop act to carry out an official large-scale...",
      "description": "Blackpink is expanding beyond music into cultural heritage to mark the Feb. 27 release of its third EP “Deadline,” becoming the first K-pop act to carry out an official large-scale collaboration with the National Museum of Korea. According to YG Entertainment on Thursday, “National Museum of Korea x Blackpink” rolls out from Feb. 26 to March. 8, in partnership with the museum and global audio streaming platform, Spotify. During the project, the museum’s exterior will be illuminated in pink as pa",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/12/news-p.v1.20260212.f66f73cb42f04af6a1d810939d33f813_T1.jpg",
      "tags": [
        "k-pop",
        "comeback",
        "blackpink"
      ]
    },
    {
      "id": "d6bf925454181351",
      "title": "BTS’ V scores 2.5b plays on Spotify with solo set",
      "url": "https://www.koreaherald.com/article/10675445",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-12T02:27:45.000Z",
      "snippet": "V of BTS exceeded 2.5 billion plays on Spotify with his first solo album, “Layover,” according to Big Hit Music on Thursday. The album rolled out in September 2023 and reached the...",
      "description": "V of BTS exceeded 2.5 billion plays on Spotify with his first solo album, “Layover,” according to Big Hit Music on Thursday. The album rolled out in September 2023 and reached the milestone on Wednesday, nearly 2 1/2 years later. The album debuted on the Billboard 200 at No. 2 and all six of its tracks made the Global 200 and Global Excl. US charts, in a first for a K-pop solo endeavor. Each track garnered more than 100 million streams on Spotify, another first for such a release. The mini album",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/12/news-p.v1.20260212.18fded7e8531493980c9a7dbb632d68c_T1.jpg",
      "tags": [
        "k-pop",
        "mini album",
        "album",
        "billboard",
        "bts"
      ]
    },
    {
      "id": "f578659de9b739d1",
      "title": "Twice reaches 900m views for 1st time with ‘What is Love?’ video",
      "url": "https://www.koreaherald.com/article/10675367",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-12T01:49:01.000Z",
      "snippet": "Twice's music video for “What is Love?” has passed 900 million views on YouTube, a first for the group, label JYP Entertainment said Thursday. The video was released in April 2018...",
      "description": "Twice's music video for “What is Love?” has passed 900 million views on YouTube, a first for the group, label JYP Entertainment said Thursday. The video was released in April 2018 for the title track from the group's fifth EP. In it, each of the nine members becomes a character from a well-known movie and visualizes their ideas of love. The six-track EP sold over 100,000 copies in the first week, the fourth-most for a K-pop girl group at the time. Twice is in the middle of the North American leg",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/12/news-p.v1.20260212.0c553aa6c2154d9f8ffd2898892d57c6_T1.jpg",
      "tags": [
        "k-pop",
        "music video",
        "twice"
      ]
    },
    {
      "id": "1d2b6264ed9825de",
      "title": "Nmixx becomes first K-pop act to perform at Brazilian Carnival in Sao Paulo",
      "url": "https://www.koreaherald.com/article/10674838",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T07:30:00.000Z",
      "snippet": "Nmixx is set to become the first-ever K-pop artist to perform at the Brazilian Carnival, one of the world’s largest and most iconic festivals. According to JYP Entertainment, Nmixx...",
      "description": "Nmixx is set to become the first-ever K-pop artist to perform at the Brazilian Carnival, one of the world’s largest and most iconic festivals. According to JYP Entertainment, Nmixx will take the stage at the Brazilian Carnival Sao Paulo, scheduled for Feb. 14 to 18. The group will appear as a special guest on Feb. 16 at a block party hosted by Brazilian pop star Pabllo Vittar — one of the main carnival festivities. The term “block party” refers to large-scale street celebrations that are a hallm",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260211.97720f3bd9294b23b2fa13b6ec72cf98_T1.jpeg",
      "tags": [
        "k-pop",
        "nmixx"
      ]
    },
    {
      "id": "63da7ff8cac33cfa",
      "title": "G-Dragon to make Middle East debut",
      "url": "https://www.koreaherald.com/article/10674747",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T06:31:11.000Z",
      "snippet": "G-Dragon is set to make his Middle East performance debut at the “Krazy Super Concert,” scheduled for Feb. 17 at Dubai Media City Amphitheater in the United Arab Emirates. The conc...",
      "description": "G-Dragon is set to make his Middle East performance debut at the “Krazy Super Concert,” scheduled for Feb. 17 at Dubai Media City Amphitheater in the United Arab Emirates. The concert marks the K-pop icon’s first official appearance in the region since his debut. “Krazy Super Concert,” which previously sold out in New York and Los Angeles, is expanding into the Middle East for the first time. The event is organized by Pu1se Events, an international EDM brand founded by Chinese entrepreneur Luffy",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260211.040539c12f1248f4b64257198ea33f0b_T1.jpg",
      "tags": [
        "k-pop",
        "debut",
        "concert"
      ]
    },
    {
      "id": "c862792381eb6fa3",
      "title": "15,000 invited to BTS’ free Gwanghwamun concert — how can the rest watch?",
      "url": "https://www.koreaherald.com/article/10674717",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T06:12:37.000Z",
      "snippet": "BTS' free concert at Gwanghwamun Square in March will have 15,000 invited fans, organizers said Wednesday. But how can those in Seoul without a ticket watch? The question has been...",
      "description": "BTS' free concert at Gwanghwamun Square in March will have 15,000 invited fans, organizers said Wednesday. But how can those in Seoul without a ticket watch? The question has been raised as an estimated 260,000 people are projected to gather near the venue — more than 11 times the square’s official capacity of 18,000. For fans who were not among the 15,000 ticket holders, the concert will be broadcast live on large digital billboards installed on buildings surrounding Gwanghwamun Square, in cent",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/12/news-p.v1.20260211.6c40b6e41fce4d2892d5cf56ded478b7_T1.jpg",
      "tags": [
        "concert",
        "bts"
      ]
    },
    {
      "id": "4eda54c024435d6e",
      "title": "Stray Kids&apos; concert movie turns into a global box-office event",
      "url": "https://www.koreaherald.com/article/10674682",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T05:51:55.000Z",
      "snippet": "Sixty-one countries, $19 million in one weekend. The men delivered. \"Stray Kids: The Dominate Experience,\" the concert movie built around the eight-member boy band's gig at Los Ang...",
      "description": "Sixty-one countries, $19 million in one weekend. The men delivered. \"Stray Kids: The Dominate Experience,\" the concert movie built around the eight-member boy band's gig at Los Angeles' SoFi Stadium last year, opened Friday and promptly did something no K-pop release has managed before: top the global weekend box office. A sold-out world tour is one thing. Topping the global box office is another. The film grossed $19.1 million across 61 territories in its opening weekend, according to the group",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260211.bc1725421847455db620cb3deed394a7_T1.jpg",
      "tags": [
        "k-pop",
        "world tour",
        "concert",
        "stray kids"
      ]
    },
    {
      "id": "aff5e0bbd02274d1",
      "title": "Enhypen extends stay on Billboard 200",
      "url": "https://www.koreaherald.com/article/10674541",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T02:51:47.000Z",
      "snippet": "Enhypen is spending its third consecutive week on the Billboard 200 with its seventh EP “The Sin: Vanish,” according to the chart published Tuesday in the US. The mini album debute...",
      "description": "Enhypen is spending its third consecutive week on the Billboard 200 with its seventh EP “The Sin: Vanish,” according to the chart published Tuesday in the US. The mini album debuted at No. 2 and ranked No. 48 on the latest chart. It is the group’s ninth entry on the main albums chart and sixth straight album to rank among the top ten. The 11-track endeavor sold more than 2 million copies in the first week and became Enhypen's fourth to do so. It logged over 250,000 shipments in Japan as of Janua",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260211.d2b15777df9f4bf7bf79dab9fa6dc1b6_T1.jpg",
      "tags": [
        "mini album",
        "album",
        "billboard"
      ]
    },
    {
      "id": "a748908ac41194b8",
      "title": "Cortis to return in April",
      "url": "https://www.koreaherald.com/article/10674321",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-11T01:21:31.000Z",
      "snippet": "Cortis will release a new album in April, said label Big Hit Music, confirming a local media report published Tuesday. The boy band's return comes about eight months after releasin...",
      "description": "Cortis will release a new album in April, said label Big Hit Music, confirming a local media report published Tuesday. The boy band's return comes about eight months after releasing its debut album “Color Outside the Lines.” The first EP sold more than 436,000 copies in the first week and had sold over 1.3 million copies as of December last year, the fourth-most and the second-most for a debut album from a K-pop boy group, respectively. The five-track set entered the Billboard 200 at No. 15 and",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260211.ca72b505c4d54cafb4cc532dc63c7df9_T1.jpg",
      "tags": [
        "k-pop",
        "debut",
        "album",
        "billboard"
      ]
    },
    {
      "id": "472e0d34b078a928",
      "title": "From rookies to global acts, K-pop increasingly turns to electronic music",
      "url": "https://www.koreaherald.com/article/10673810",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-10T06:51:50.000Z",
      "snippet": "An increasing number of K-pop acts are leaning into electronic music, signaling what could emerge as one of the genre’s defining sonic currents this year. From rookie groups such a...",
      "description": "An increasing number of K-pop acts are leaning into electronic music, signaling what could emerge as one of the genre’s defining sonic currents this year. From rookie groups such as KiiiKiii to established acts including Ive and Blackpink, artists are selecting house or electronic dance tracks as their lead singles. Even BTS is reported to have collaborated with American DJ and producer Diplo on its upcoming album “Arirang,” due March 20, further fueling expectations around an EDM-driven directi",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/11/news-p.v1.20260210.38c1b823e5e042bc8da2370b417090c9_T1.jpg",
      "tags": [
        "k-pop",
        "album",
        "bts",
        "blackpink",
        "ive"
      ]
    },
    {
      "id": "777159c9edc5f7c1",
      "title": "Le Sserafim tops Oricon singles chart",
      "url": "https://www.koreaherald.com/article/10673569",
      "source": "Korea Herald K-pop",
      "publishedAt": "2026-02-10T02:45:00.000Z",
      "snippet": "Le Sserafim claimed the No. 1 spot on Oricon’s Weekly Single Ranking with “Spaghetti,” according to the chart published Tuesday. This is the first time in three years an internatio...",
      "description": "Le Sserafim claimed the No. 1 spot on Oricon’s Weekly Single Ranking with “Spaghetti,” according to the chart published Tuesday. This is the first time in three years an international female act sat atop the chart. The five-member group nabbed the highest rung on the chart three months after the album release, notching the spot it landed in 2023 with its Japan debut single “Fearless.” The chart success owes to the quintet’s first international tour, “Easy Crazy Hot,” which saw it play the Tokyo",
      "image": "https://wimg.heraldcorp.com/news/cms/2026/02/10/news-p.v1.20260210.a4021eea0dd9494d9793031cfbb0c21c_T1.jpg",
      "tags": [
        "debut",
        "album",
        "le sserafim"
      ]
    }
  ]
}